{
  "backend/main.mo": "Main Motoko actor defining the NEXUS backend with user/pro profile management, booking system, access control, blob storage, and Stripe integration. Exposes query and update methods for profile CRUD, bookings, and subscription handling.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their titles, affected frontend files, component dependencies, and test IDs. Covers UI SVG icon replacement, photo upload grid, and subscription activation flow features.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's component structure, context providers, utilities, and design system.",
  "frontend/index.css": "Tailwind CSS entry file defining shadcn/ui OKLCH design tokens (colors, radius, sidebar) for both light and dark themes, plus base border and background utility applications.",
  "frontend/index.html": "HTML entry point for the NEXUS app loading Inter font from Google Fonts, setting viewport-fit=cover for iOS safe areas, and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the app with QueryClientProvider, AuthContextProvider, and AppContextProvider, rendering ScreenRouter inside an app-container div.",
  "frontend/src/AppV1.jsx": "Empty legacy file, previously the V1 application entry point with no current content.",
  "frontend/src/components/BookingContact.tsx": "Booking contact form screen collecting name, phone, and address fields, simulating a confirmation delay and redirecting to the explorer on success.",
  "frontend/src/components/BookingDate.tsx": "Booking date and time selection screen with day pills and a 3-column time slot grid, navigating to the booking flow on confirmation.",
  "frontend/src/components/BookingFlow.tsx": "Multi-step booking flow component (Service, Créneau, Adresse, Récap, Paiement) with time slot selection, address input, QR code display, and a success animation with confetti on completion.",
  "frontend/src/components/BookingLocation.tsx": "Simple booking location selector allowing the user to choose between 'À domicile' or 'En studio', then navigate to the booking flow.",
  "frontend/src/components/BottomNav.tsx": "Bottom navigation bar component that renders role-aware tabs with SVG icons, active state highlighting in gold, and a pending bookings badge indicator.",
  "frontend/src/components/Builder.tsx": "Three-step pro profile creation wizard where users enter brand name, category, city, bio, and services, then save the profile via setProProfile and navigate to the main OS screen.",
  "frontend/src/components/BuilderPreviewModal.tsx": "Full-screen modal that previews a pro's profile page including cover photo, logo, badges, bio, social media links, and services based on builder form data.",
  "frontend/src/components/BuilderProgress.tsx": "Reusable step-progress indicator component that displays numbered steps with labels, marking completed steps in green and the current step in gold.",
  "frontend/src/components/ClientDashboard.tsx": "Displays a client's booking dashboard with pending and confirmed reservations, showing booking cards with status, date, time, and price. Includes logout functionality and uses GlobalHeader and BottomNav for layout.",
  "frontend/src/components/ClientLogin.tsx": "Empty file with no content or exports.",
  "frontend/src/components/CroppingModal.tsx": "A modal component for interactively cropping and repositioning images with drag-to-pan and zoom controls. Supports configurable aspect ratios and saves crop parameters including scale and offsets.",
  "frontend/src/components/Explorer.tsx": "A browsable directory of professional service providers with search and category filtering. Displays pro cards with ratings and flash availability, using demo data and navigating to individual pro profiles.",
  "frontend/src/components/GalleryPhotoUpload.tsx": "A gallery photo management component that renders a grid of ImageUploader slots with a minimum photo count enforced. Supports adding and removing photo slots with drag-handle indicators.",
  "frontend/src/components/GlobalHeader.tsx": "A fixed top navigation header showing the NEXUS logo, a notification bell with unread badge count, and a user avatar with initials. Integrates with AppContext for role-aware styling and notification center toggling.",
  "frontend/src/components/ImageUploader.tsx": "An image upload component supporting drag-and-drop or file input with validation, automatic compression when localStorage is near capacity, and an integrated cropping modal. Persists image data and crop parameters to localStorage.",
  "frontend/src/components/LandingPage.tsx": "Renders the initial landing page with the NEXUS branding and a 'Commencer' button that navigates to the splash screen.",
  "frontend/src/components/LiveStatus.tsx": "Displays a live booking status tracker with a countdown timer and a multi-step timeline that auto-progresses to simulate a pro's arrival.",
  "frontend/src/components/MessagingSheet.tsx": "A bottom-sheet chat UI between a client and a pro, with pre-seeded messages and auto-reply simulation when the pro sends a message.",
  "frontend/src/components/MonBusiness.tsx": "Pro-facing business profile management screen with tabs for identity, payment, services, and a photo gallery, plus a subscription modal trigger.",
  "frontend/src/components/NexusOS.tsx": "Pro dashboard home screen showing a welcome greeting, booking stats grid, and a Flash mode toggle for availability.",
  "frontend/src/components/NotificationCenter.tsx": "A bottom-sheet notification panel that lists all notifications with unread highlighting, mark-all-read, and individual dismiss actions.",
  "frontend/src/components/OTPVerification.tsx": "A 4-digit OTP verification screen that accepts numeric input, validates against the hardcoded demo code '1234', and navigates to the explorer view on success while setting the user role and name.",
  "frontend/src/components/PaymentForm.tsx": "A payment form component with card number, expiry, and CVC fields that formats input, validates each field, and reports validity and form data to the parent via a callback prop.",
  "frontend/src/components/ProDashboard.tsx": "A thin wrapper component that immediately redirects to the 'nexusOS' route and renders nothing.",
  "frontend/src/components/ProLogin.tsx": "A professional login screen that triggers Internet Identity authentication and navigates to the NexusOS dashboard on success.",
  "frontend/src/components/ProOnboardingModal.tsx": "A bottom-sheet modal that presents pro subscription benefits, saves the user's professional profile to the backend, and navigates to the profile builder on confirmation.",
  "frontend/src/components/ProProfile.tsx": "A detailed professional profile page displaying services, reviews, a photo gallery, and animated stats, with an option to initiate a booking flow for a selected service.",
  "frontend/src/components/ProSubscriptionModal.tsx": "A subscription modal for professionals that collects an email, simulates a loading progress bar, shows a confetti success animation, and then activates the pro trial and navigates to NexusOS.",
  "frontend/src/components/ProviderDetail.tsx": "Displays a detailed view of a selected service provider, including their cover image, avatar, rating, and list of bookable services with a back button to the explorer screen.",
  "frontend/src/components/RadarPro.tsx": "Pro-facing dashboard screen showing incoming client booking requests with accept/decline actions, separating pending and handled requests using mock data.",
  "frontend/src/components/RadiusSimulator.tsx": "Interactive UI component that visualizes a service radius on a circular map graphic with a range slider, allowing users to set a distance between 0 and 50 km.",
  "frontend/src/components/RoleSelection.tsx": "Onboarding screen where users choose between 'Client' and 'Pro' roles, then navigate to the appropriate next screen (OTP or subscription) based on their selection.",
  "frontend/src/components/ScreenRouter.tsx": "Central routing component that lazily loads and conditionally renders the correct screen component based on the current screen value from AppContext.",
  "frontend/src/components/ServicePhotoUpload.tsx": "Form component for uploading up to 5 photos per service, with a required main photo slot and optional additional slots that can be added or removed dynamically.",
  "frontend/src/components/Splash.tsx": "Landing splash screen for the NEXUS app featuring animated ambient orbs, the app logo, tagline, and a connect button that navigates to role selection.",
  "frontend/src/components/Subscription.tsx": "Static subscription upsell screen displaying a 7-day free trial offer with a benefits list; navigates to nexusOS on confirm or back to roleSelection on dismiss.",
  "frontend/src/components/SubscriptionScreen.tsx": "Enhanced subscription screen that activates the subscription state and fires a notification when the user starts the free trial, then navigates to nexusOS.",
  "frontend/src/components/SupportChat.tsx": "Floating live-chat widget with a toggle button, message history, keyword-based auto-responses, typing indicator, and quick-action shortcuts.",
  "frontend/src/components/UpgradeModal.tsx": "Bottom-sheet modal prompting users to upgrade to a Pro account, listing benefits and calling upgradeToProAccount from context on confirmation.",
  "frontend/src/components/WalletPro.tsx": "Pro wallet dashboard showing available balance, a weekly earnings bar chart, escrow info, and a Revolut transfer button with toast feedback.",
  "frontend/src/components/Welcome.tsx": "Onboarding screen that collects the user's first name, sets the app role to client, and navigates to the explorer view.",
  "frontend/src/context/AppContext.tsx": "Defines the global AppContext with all shared app state including navigation history, user/pro profiles, bookings, wallet, notifications, and radar data, along with their types and a provider component.",
  "frontend/src/context/AuthContext.tsx": "Wraps the useInternetIdentity hook into a React context providing isAuthenticated, principal, login, and logout to the component tree.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, reinitializing dependent queries whenever the identity changes.",
  "frontend/src/hooks/useCarousel.ts": "Empty file with no content.",
  "frontend/src/hooks/useCountingAnimation.ts": "Empty file with no content.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty file with no content.",
  "frontend/src/hooks/useGeolocation.ts": "Hook that requests the browser's geolocation, stores coordinates in sessionStorage, and exposes loading/error state along with a requestPermission callback.",
  "frontend/src/hooks/useImageUpload.ts": "Hook that handles image file selection via drag-and-drop or file input, validates format and size, converts to base64, and exposes preview/error/uploading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication using DFINITY's AuthClient, providing a React context and hook with login, logout, identity, and status state management.",
  "frontend/src/hooks/useParallax.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, pro profiles, location filtering, and booking CRUD operations.",
  "frontend/src/hooks/useScrollReveal.ts": "Empty file with no content.",
  "frontend/src/index.css": "Global CSS for the Nexus v5.0 design system, defining CSS variables (colors, radius), base resets, app container layout, keyframe animations, and utility classes like glass effects.",
  "frontend/src/main.tsx": "Entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/cropping.ts": "TypeScript interfaces defining crop parameters (scale, offsets, image data) and image data structure.",
  "frontend/src/utils/auraGenerator.ts": "Empty file with no content or exports.",
  "frontend/src/utils/cityData.ts": "Defines Swiss Romande cities, inter-city distance tables, and utility functions for proximity categorization and distance formatting.",
  "frontend/src/utils/confetti.ts": "Renders an animated golden confetti effect on a full-screen canvas overlay for 3 seconds using requestAnimationFrame.",
  "frontend/src/utils/demoData.ts": "Defines TypeScript interfaces and a static array of demo professional profiles with services, reviews, and metadata for UI prototyping.",
  "frontend/src/utils/haversine.ts": "Exports a function that calculates the distance in kilometers between two GPS coordinates using the Haversine formula.",
  "frontend/src/utils/imageCompression.ts": "Provides utilities to compress a base64 image via canvas, calculate base64 byte size, and measure total localStorage usage.",
  "frontend/src/utils/nominatim.ts": "Geocodes a city name via the Nominatim API with localStorage caching, and exports a Haversine distance helper.",
  "frontend/src/utils/servicePresets.ts": "Defines preset service lists (name, price, duration, badges) for categories like Barber, Coiffure, Esthétique, and Massage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL/hash query parameters, persisting them in sessionStorage, and cleaning sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the NEXUS frontend, defining dark mode, custom color palette (void/dark tones, gold, flash green, alert red), typography, border radii, shadows, and a full set of custom keyframe animations.",
  "project_state.json": "Project state manifest (v3) describing the NEXUS beauty-services marketplace app, its design system rules, known issues, and a detailed registry of existing and planned features across Pro and Client roles."
}