{
  "backend/main.mo": "Main ICP actor defining all backend types (UserProfile, ProProfile, Booking, etc.), state maps, and integrations for access control, blob storage, Stripe, and HTTP outcalls. Includes commented-out Payrexx and heartbeat payment release logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to their implementing frontend files, component dependencies, and test IDs for build verification.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, used as a reference document describing the purpose and key details of every frontend component, hook, utility, and context.",
  "frontend/index.css": "Global CSS entry point defining Tailwind directives and all shadcn/ui CSS custom property design tokens for light and dark themes (colors, radius, sidebar, charts).",
  "frontend/index.html": "HTML shell loading Inter font from Google Fonts with viewport-fit=cover for iOS, mounting the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React component wrapping the app with QueryClientProvider, AuthContextProvider, and AppContextProvider, rendering ScreenRouter inside an app-container div.",
  "frontend/src/AppV1.jsx": "Empty legacy file, previously the complete QuickReveal/NEXUS v1 application with landing, pro cockpit, and client explorer views.",
  "frontend/src/components/BookingContact.tsx": "Booking contact form screen collecting name, phone, and address, with a simulated async confirmation flow that navigates back to the explorer on success.",
  "frontend/src/components/BookingDate.tsx": "Booking date and time selection screen with day pills and a time slot grid, navigating to the booking flow when a time is confirmed.",
  "frontend/src/components/BookingFlow.tsx": "A multi-step booking flow component (5 steps: service, location, date/time, client info, confirmation) that collects booking details and navigates to the live status screen upon confirmation.",
  "frontend/src/components/BookingLocation.tsx": "A simple location selection component allowing users to choose between 'à domicile' or 'en studio' before continuing to the booking flow.",
  "frontend/src/components/BottomNav.tsx": "A bottom navigation bar component that renders role-aware tabs with SVG icons, highlights the active screen, and shows a pending bookings badge.",
  "frontend/src/components/Builder.tsx": "A 3-step pro profile creation wizard that collects brand name, category, city, bio, and services, then constructs and saves a DemoPro profile via context.",
  "frontend/src/components/BuilderPreviewModal.tsx": "A full-screen modal that previews a pro's profile page including cover photo, logo, badges, bio, and social media links before publishing.",
  "frontend/src/components/BuilderProgress.tsx": "A reusable step-progress indicator component that displays numbered steps with labels, marking completed steps with a checkmark and highlighting the current step.",
  "frontend/src/components/BusinessScreen.tsx": "Pro business management screen with sub-tabs for identity, payment, services, and gallery. Handles photo uploads, service presets, and subscription activation flow.",
  "frontend/src/components/ClientDashboard.tsx": "Client-facing dashboard displaying pending and confirmed bookings with cancel functionality and a bottom navigation bar.",
  "frontend/src/components/ClientLogin.tsx": "Empty file with no content.",
  "frontend/src/components/CroppingModal.tsx": "Modal component for interactively cropping images via drag and zoom, supporting configurable aspect ratios and saving crop parameters.",
  "frontend/src/components/DashboardScreen.tsx": "Pro dashboard showing stats (reservations, clients, rating, flash status) and a status banner prompting profile activation if not yet active.",
  "frontend/src/components/Explorer.tsx": "Explorer screen for browsing and searching pro service providers, filterable by category, with navigation to provider detail pages.",
  "frontend/src/components/ExplorerV2.tsx": "Main explorer screen for clients that displays a searchable, filterable list of service professionals with flash deals, a bottom navigation bar, and navigation to pro profile pages.",
  "frontend/src/components/GalleryPhotoUpload.tsx": "A grid-based photo upload component that manages multiple image slots with a minimum count, allowing adding/removing slots and delegating each upload to the ImageUploader component.",
  "frontend/src/components/GlobalHeader.tsx": "A sticky top header bar showing the NEXUS logo, a notification bell with unread badge, and a user avatar that navigates to the notification center on click.",
  "frontend/src/components/icons/Icons.tsx": "Exports a collection of reusable SVG icon components (Flash, Search, Check, X, Bell, Radar, Wallet, Dashboard, Business, Star, etc.) with configurable size and color props.",
  "frontend/src/components/ImageUploader.tsx": "An image upload component supporting drag-and-drop or file input, with automatic compression, localStorage persistence, and a cropping modal that opens after upload.",
  "frontend/src/components/LandingPage.tsx": "A minimal landing page displaying the NEXUS brand and a single 'Commencer' button that navigates to the splash screen.",
  "frontend/src/components/LiveStatus.tsx": "A live booking status screen showing an elapsed-time counter and a step-by-step timeline tracking the progress of an active service booking.",
  "frontend/src/components/Login.tsx": "A login screen with Internet Identity authentication and a demo fallback, navigating to role selection on success, styled with ambient background orbs and the NEXUS branding.",
  "frontend/src/components/MessagingSheet.tsx": "A bottom-sheet messaging UI component that displays a conversation between a client and a pro, with auto-reply simulation and a message input field.",
  "frontend/src/components/MonBusiness.tsx": "A thin wrapper component that delegates rendering entirely to ProLayout for the pro business space.",
  "frontend/src/components/NexusOS.tsx": "A thin wrapper component that renders ProLayout as the main NexusOS pro interface.",
  "frontend/src/components/NotificationCenter.tsx": "Displays a list of user notifications with options to mark all as read or remove individual notifications, using AppContext for state.",
  "frontend/src/components/OTPVerification.tsx": "A 4-digit OTP verification screen that accepts demo code '1234' to authenticate and navigate the user to the explorer screen as a client.",
  "frontend/src/components/OTPVerificationV2.tsx": "An updated OTP verification screen with paste support and a back button, navigating to 'explorerV2' on successful demo code entry.",
  "frontend/src/components/PaymentForm.tsx": "A credit card payment form component with real-time validation for card number, expiry, and CVC fields, reporting validity and data via a callback prop.",
  "frontend/src/components/ProDashboard.tsx": "A redirect component that immediately navigates to 'nexusOS' on mount, acting as an alias for the NexusOS screen.",
  "frontend/src/components/ProFiche.tsx": "Displays a detailed professional profile page with animated count-up stats (rating, reviews, response time, acceptance rate, services) and a cover/avatar section, navigating back to explorerV2.",
  "frontend/src/components/ProLayout.tsx": "Root layout for the pro-side app that wraps content in ProProvider and renders tab-based navigation between Radar, Wallet, Dashboard, and Business screens.",
  "frontend/src/components/ProLogin.tsx": "Login screen for the professional space that triggers Internet Identity authentication and navigates to nexusOS on success.",
  "frontend/src/components/ProOnboardingModal.tsx": "Bottom-sheet modal that presents pro subscription benefits, saves the user's professional role to the backend, and navigates to the profile builder on confirmation.",
  "frontend/src/components/ProProfile.tsx": "Alternative professional profile view with animated count-up stats and a services list, similar to ProFiche but using navigateTo instead of setCurrentScreen.",
  "frontend/src/components/ProSubscriptionModal.tsx": "Full-screen subscription modal where a pro enters their email to start a 7-day free trial, then activates their profile and redirects to nexusOS on success.",
  "frontend/src/components/ProTabBar.tsx": "Bottom tab bar for the pro interface with four tabs (Radar, Wallet, Dashboard, Business), highlighting the active tab in gold and showing a dot indicator when the pro is active.",
  "frontend/src/components/ProviderDetail.tsx": "Displays a detailed view of a selected service provider, including a cover gradient, avatar initials, stats (rating, reviews, price), bio, and services list, with a back button to the explorer screen.",
  "frontend/src/components/RadarPro.tsx": "Renders the pro-side Radar dashboard showing booking requests grouped into pending, confirmed, and history sections using demo data, with a reusable RequestCard sub-component.",
  "frontend/src/components/RadiusSimulator.tsx": "A controlled UI component that visualizes a geographic search radius with an animated expanding circle and a styled range slider, accepting a value and onChange callback as props.",
  "frontend/src/components/RoleSelection.tsx": "A role selection screen where users choose between Client and Professionnel profiles, then navigate to the appropriate onboarding flow via a Continue button.",
  "frontend/src/components/RoleSelectionV2.tsx": "An updated role selection screen with icon-enhanced cards for Client and Pro roles, setting the app role in context and navigating to the corresponding onboarding screen on selection.",
  "frontend/src/components/ScreenRouter.tsx": "Central routing component that lazily loads and renders all app screens based on the current screen value from AppContext, also displaying an SMSToast overlay.",
  "frontend/src/components/ServicePhotoUpload.tsx": "Component for uploading up to 5 service photos, with a required main photo slot and optional additional slots that can be added or removed.",
  "frontend/src/components/SMSToast.tsx": "An animated toast notification component that displays a simulated SMS confirmation with slide/fade transitions; includes a commented-out stub documenting that Twilio SMS must only be called from the backend, never the frontend.",
  "frontend/src/components/Splash.tsx": "Animated splash/landing screen displaying the NEXUS logo with ambient orb effects and a connect button that navigates to role selection.",
  "frontend/src/components/Subscription.tsx": "Simple subscription screen listing pro plan benefits with a 7-day free trial CTA that navigates to nexusOS on confirmation.",
  "frontend/src/components/SubscriptionModal.tsx": "Full-screen modal for starting a 7-day free trial, collecting an email and displaying plan benefits before navigating to proSuccess.",
  "frontend/src/components/SubscriptionScreen.tsx": "Subscription activation screen that sets the subscription as active, adds a notification, and navigates to nexusOS when the user starts the free trial.",
  "frontend/src/components/SubscriptionSuccess.tsx": "Displays a full-screen animated subscription activation screen with a progress bar that fills over 3.5 seconds, then sets the pro context active and calls a completion callback after 4.5 seconds.",
  "frontend/src/components/SupportChat.tsx": "A floating chat widget with a toggle button that shows a chat modal supporting keyword-based auto-responses and quick-action shortcuts for common support topics.",
  "frontend/src/components/UpgradeModal.tsx": "A modal dialog prompting users to upgrade to a Pro account, listing key benefits and providing Cancel/Continue buttons that call upgradeToProAccount from AppContext.",
  "frontend/src/components/WalletPro.tsx": "Displays a pro user's wallet balance with a transfer-to-bank button that zeroes the balance and enforces a 30-second cooldown timer before the next transfer.",
  "frontend/src/components/Welcome.tsx": "Onboarding screen that collects the user's first name, sets the app role to 'client', and navigates to the explorer view, with an option to skip name entry.",
  "frontend/src/context/AppContext.tsx": "Defines the global AppContext with all app-wide state including current screen, role, booking data, notifications, wallet, and navigation helpers. Provides typed interfaces for bookings, notifications, wallet, and SMS toasts.",
  "frontend/src/context/AuthContext.tsx": "Wraps the useInternetIdentity hook in a React context to expose authentication state (isAuthenticated, principal, identity) and login/logout handlers app-wide.",
  "frontend/src/context/ProContext.tsx": "Provides a React context for pro-specific state including pro activation status, pro profile data, and wallet cooldown timer.",
  "frontend/src/data/mockData.ts": "Re-exports DemoPro types and DEMO_PROS from demoData utils, and defines mock data structures and constants for wallet transactions, radar bookings, and demo scenarios.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useCarousel.ts": "Empty file with no content.",
  "frontend/src/hooks/useCountingAnimation.ts": "Empty file with no content.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty file with no content.",
  "frontend/src/hooks/useGeolocation.ts": "Hook that requests the browser's geolocation API, stores coordinates in sessionStorage, and exposes loading/error state along with a requestPermission callback.",
  "frontend/src/hooks/useImageUpload.ts": "Hook that handles image file validation (format and size), drag-and-drop, and file input events, converting valid images to base64 and exposing preview and error state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via DFINITY AuthClient, providing a React context and hook with login, logout, and identity state including initialization and login status tracking.",
  "frontend/src/hooks/useParallax.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor calls including user profiles, pro profiles, location filtering, and booking CRUD operations with cache invalidation.",
  "frontend/src/hooks/useScrollReveal.ts": "Empty file, likely a placeholder for a scroll reveal animation hook.",
  "frontend/src/index.css": "Global CSS file defining CSS custom properties (design tokens), base resets, app layout constraints, scrollbar hiding, and all keyframe animations used throughout the app.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/types/cropping.ts": "TypeScript interfaces defining crop parameters (scale, offsets, image data) and a combined ImageData type used for image cropping functionality.",
  "frontend/src/utils/auraGenerator.ts": "Empty file, likely a placeholder for an aura/gradient generation utility.",
  "frontend/src/utils/cityData.ts": "Provides Swiss Romande city lists, proximity zones, approximate inter-city distances in km, and helper functions for distance lookup, proximity categorization, and radius filtering.",
  "frontend/src/utils/confetti.ts": "Implements a canvas-based golden confetti animation that spawns falling particles for 3 seconds then removes itself from the DOM.",
  "frontend/src/utils/demoData.ts": "Contains static demo data types and arrays for mock professionals and their services (barber, hair, aesthetics, massage) used for UI prototyping.",
  "frontend/src/utils/haversine.ts": "Exports a calculateDistance function that computes the distance in kilometers between two GPS coordinates using the Haversine formula.",
  "frontend/src/utils/imageCompression.ts": "Provides utilities to measure localStorage usage, compress a base64 image via canvas to JPEG, and calculate the byte size of a base64 string.",
  "frontend/src/utils/nominatim.ts": "Geocodes city/address strings via the Nominatim OpenStreetMap API with localStorage caching, and includes a Haversine distance helper function.",
  "frontend/src/utils/servicePresets.ts": "Defines service preset types and a record of predefined services (name, price, duration, badges) grouped by category (Barber, Coiffure, Esthétique, Massage). Also exports the CATEGORIES constant and Category type.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL parameters from both query strings and hash-based routing, persisting them in sessionStorage, and cleaning sensitive params from the URL bar without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the NEXUS frontend, defining a dark-themed color palette, custom border radii, box shadows, fonts, and a rich set of named animations and keyframes.",
  "project_state.json": "Tracks the current state of the NEXUS project (v3), documenting architectural decisions, known issues, and a list of implemented features for the pro-space patch (v6.1) including ProContext, ProLayout, BusinessScreen sub-tabs, photo upload, and subscription flow."
}