{
  "backend/main.mo": "Main ICP actor defining all backend types (UserProfile, ProProfile, Booking, Service, etc.), state maps, and integrations including access control, blob storage, Stripe, and HTTP outcalls. Contains commented-out Payrexx and heartbeat payment release logic.",
  "feature_evidence.json": "Feature evidence report mapping three feature requirements to their target files: creating ProApp.tsx as a self-contained pro-space component, defining color constants with C.t4, and wiring ProApp into RoleSelectionV2.tsx.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering components, context, hooks, utilities, and configuration files across the project.",
  "frontend/index.css": "Global CSS entry point importing Tailwind layers and defining shadcn CSS custom property tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "HTML entry point loading Inter font from Google Fonts, setting viewport-fit=cover for iOS, and mounting the React app via main.tsx into the root div.",
  "frontend/src/App.tsx": "Root React component wrapping the app with QueryClientProvider, AuthContextProvider, and AppContextProvider, rendering ScreenRouter inside a centered 430px container with a --void background.",
  "frontend/src/AppV1.jsx": "Empty legacy file, previously the V1 application entry point with no current content.",
  "frontend/src/components/BookingContact.tsx": "Booking contact form screen collecting name, phone, and address, with a simulated async confirmation flow that navigates back to the explorer on success.",
  "frontend/src/components/BookingDate.tsx": "Booking date and time selection screen with day pills and a time slot grid, navigating to the booking flow when a time is selected.",
  "frontend/src/components/BookingFlow.tsx": "A multi-step booking flow component (5 steps: service, location, date/time, client info, confirmation) that collects booking details and navigates to the live status screen upon confirmation.",
  "frontend/src/components/BookingLocation.tsx": "A simple screen for selecting the service location (domicile or studio) with a continue button that navigates to the booking flow.",
  "frontend/src/components/BottomNav.tsx": "A bottom navigation bar component that renders role-aware tabs with SVG icons, highlights the active screen, and shows a pending bookings badge.",
  "frontend/src/components/Builder.tsx": "A 2-step profile builder form for professionals to enter their name, city, category, bio, and services, then creates a new pro profile and navigates to its fiche page.",
  "frontend/src/components/BuilderPreviewModal.tsx": "A full-screen modal that previews a professional's built profile, displaying cover photo, logo, name, badges, bio, and social media links.",
  "frontend/src/components/BuilderProgress.tsx": "A reusable step-progress indicator component that displays numbered steps with labels, marking completed steps with a checkmark and highlighting the current step.",
  "frontend/src/components/BusinessScreen.tsx": "Pro business management screen with sub-tabs for identity, payment, services, and gallery; handles photo uploads with a 3-photo minimum requirement to activate the profile.",
  "frontend/src/components/ClientDashboard.tsx": "Client-facing dashboard displaying pending and confirmed bookings with cancel functionality and a navigation prompt when no bookings exist.",
  "frontend/src/components/ClientLogin.tsx": "Empty file with no content.",
  "frontend/src/components/Confetti.tsx": "Renders an animated confetti overlay of 30 randomly positioned, colored, and timed falling particles using CSS keyframe animation.",
  "frontend/src/components/CroppingModal.tsx": "A modal for interactively cropping an image via drag and zoom controls, supporting configurable aspect ratios and persisting crop parameters on save.",
  "frontend/src/components/DashboardScreen.tsx": "Pro dashboard showing greeting, stats, and an activation banner or active-profile status depending on whether the pro profile is activated.",
  "frontend/src/components/Explorer.tsx": "Explorer screen listing demo professionals with search and category filter controls, navigating to a pro's profile on selection.",
  "frontend/src/components/ExplorerV2.tsx": "A discovery screen component that displays beauty professionals with search, category filtering, and rotating subtitles. Renders flash-deal pros and a filtered pro list, navigating to a pro profile on click.",
  "frontend/src/components/GalleryPhotoUpload.tsx": "A gallery photo upload component that manages a grid of image slots with a minimum count, supporting adding/removing slots and delegating each upload to the ImageUploader component.",
  "frontend/src/components/GlobalHeader.tsx": "A sticky top header displaying the NEXUS logo, a notification bell with unread badge, and a user avatar initial, linking to the notification center.",
  "frontend/src/components/icons/Icons.tsx": "Library of reusable SVG icon components (Flash, Search, Check, X, Bell, Radar, Wallet, Dashboard, Business, Star, Lock, etc.) accepting size, color, and className props.",
  "frontend/src/components/ImageUploader.tsx": "An image upload component supporting drag-and-drop or file input, with validation, optional localStorage compression, and automatic opening of a cropping modal after upload.",
  "frontend/src/components/LandingPage.tsx": "A minimal landing page displaying the NEXUS brand and a single 'Commencer' button that navigates to the splash screen.",
  "frontend/src/components/LiveStatus.tsx": "A live booking status screen showing an elapsed-time counter and a step-by-step timeline tracking the progress of an ongoing service appointment.",
  "frontend/src/components/Login.tsx": "A login screen with Internet Identity authentication and a demo fallback, both routing to the role selection screen after login.",
  "frontend/src/components/MessagingSheet.tsx": "A bottom-sheet messaging UI component that displays a conversation between a client and a pro, with auto-reply simulation and message sending functionality.",
  "frontend/src/components/MonBusiness.tsx": "A thin wrapper component that renders ProLayout for the 'Mon Business' section.",
  "frontend/src/components/NexusOS.tsx": "A thin wrapper component that renders ProLayout for the NexusOS section.",
  "frontend/src/components/NotificationCenter.tsx": "Displays a list of user notifications with options to mark all as read or remove individual notifications, using AppContext for state management.",
  "frontend/src/components/OTPVerification.tsx": "A 4-digit OTP verification screen that accepts code '1234' for demo purposes, then sets the app role to 'client' and navigates to the explorer screen.",
  "frontend/src/components/OTPVerificationV2.tsx": "An updated OTP verification screen (V2) with paste support and loading/error states, navigating to 'explorerV2' on successful code entry.",
  "frontend/src/components/PaymentForm.tsx": "A credit card payment form with real-time validation for card number, expiry, and CVC fields, reporting validity and data to the parent via a callback prop.",
  "frontend/src/components/ProApp.tsx": "Self-contained Pro app root component managing global state (view, wallet, profile) with inline sub-components for Dashboard, Radar, Wallet, Business, Modal, Success, and a TabBar.",
  "frontend/src/components/ProDashboard.tsx": "Thin redirect component that immediately navigates to the 'nexusOS' view via AppContext on mount.",
  "frontend/src/components/ProErrorBoundary.tsx": "React class-based error boundary that catches runtime errors in the Pro section and displays a styled French-language error screen with a retry button.",
  "frontend/src/components/ProFiche.tsx": "Detail page for a selected professional, showing a cover image, name, rating, flash badge, and list of services with a selection state.",
  "frontend/src/components/ProLayout.tsx": "Layout shell for the Pro section that composes RadarPro, WalletPro, DashboardScreen, and BusinessScreen under a ProTabBar, with subscription modal and success overlay management.",
  "frontend/src/components/ProLogin.tsx": "Login screen for the Pro space that triggers Internet Identity authentication and redirects to 'nexusOS' on success.",
  "frontend/src/components/ProOnboardingModal.tsx": "Bottom-sheet modal presenting Pro subscription benefits, saving the user's professional role to the backend, then navigating to the profile builder.",
  "frontend/src/components/ProProfile.tsx": "Displays a detailed profile page for a selected professional, including a cover image, animated stats (rating, reviews), services list, and a back navigation button. Uses a custom count-up animation hook for numeric stats.",
  "frontend/src/components/ProSubscriptionModal.tsx": "A full-screen modal for pro subscription sign-up, showing a 7-day free trial offer with a list of benefits and an email input. On submission, it simulates an async call, sets the pro as active with flash enabled, and navigates to the NexusOS screen.",
  "frontend/src/components/ProTabBar.tsx": "A bottom tab bar component for the pro interface with four tabs: Radar, Wallet, Dashboard, and Business. Highlights the active tab in gold and accepts an onChange callback.",
  "frontend/src/components/ProviderDetail.tsx": "Renders a provider detail page with a cover image, name, rating, stats grid, bio, and a selectable services list. Falls back to a default service if none are defined on the pro object.",
  "frontend/src/components/RadarPro.tsx": "A pro-side radar dashboard showing incoming booking requests with countdown timers, confirmed appointments, and history across three tabs. Supports accept/decline actions with a simulated SMS toast notification.",
  "frontend/src/components/RadiusSimulator.tsx": "An interactive radius selector component that visually displays a growing circle proportional to the selected km value, controlled by a styled range slider up to 50 km.",
  "frontend/src/components/RoleSelection.tsx": "A role selection screen for the NEXUS app where users choose between 'Client' and 'Professionnel' profiles, navigating to OTP verification or pro onboarding respectively.",
  "frontend/src/components/RoleSelectionV2.tsx": "An updated role selection screen with icon-enhanced cards and press animations, routing clients to OTP flow and pros directly to the ProApp component.",
  "frontend/src/components/ScreenRouter.tsx": "A lazy-loading screen router that maps currentScreen context values to the appropriate React component, with a spinner fallback during code-splitting loads.",
  "frontend/src/components/ServicePhotoUpload.tsx": "A photo upload manager for service listings supporting up to 5 images, with a required main photo slot, removable additional slots, and drag-handle indicators using the ImageUploader component.",
  "frontend/src/components/SMSToast.tsx": "An animated toast notification component that displays an SMS-sent confirmation with phone number and message, auto-dismissing after ~4 seconds. Includes a commented-out Twilio integration stub with security warnings against frontend credential exposure.",
  "frontend/src/components/Splash.tsx": "An animated splash/landing screen featuring ambient gradient orbs, the NEXUS logo, a tagline, and a connect button that navigates to role selection.",
  "frontend/src/components/Subscription.tsx": "Full-screen subscription page displaying a 7-day free trial offer with a list of benefits and CTA buttons to start the trial or go back to role selection.",
  "frontend/src/components/SubscriptionModal.tsx": "Bottom-sheet modal presenting subscription benefits with a simulated 800ms activation delay before triggering the subscribe callback.",
  "frontend/src/components/SubscriptionScreen.tsx": "Subscription activation screen that sets subscription state, adds a notification, and navigates to the main OS view when the user starts the free trial.",
  "frontend/src/components/SubscriptionSuccess.tsx": "Animated success screen shown after subscription activation, progressing through a loading phase with a progress bar then a confetti success state before calling onComplete.",
  "frontend/src/components/SupportChat.tsx": "Floating chat widget with a keyword-based auto-response system, quick-action buttons, and a typing indicator for simulated support interactions.",
  "frontend/src/components/UpgradeModal.tsx": "Modal dialog prompting users to upgrade to a Pro account, listing key benefits and calling upgradeToProAccount from context on confirmation.",
  "frontend/src/components/WalletPro.tsx": "React component displaying a pro user's wallet with balance, weekly bar chart, transaction history, and a transfer-to-IBAN button that triggers a 30-second cooldown and SMS toast notification.",
  "frontend/src/components/Welcome.tsx": "Onboarding screen that prompts the user to enter their first name, sets the app role to 'client', and navigates to the explorer screen.",
  "frontend/src/context/AppContext.tsx": "Central React context providing global app state including navigation history, user role, selected pro, booking data, notifications, wallet, SMS toast, and subscription status.",
  "frontend/src/context/AuthContext.tsx": "Authentication context wrapping the Internet Identity hook to expose isAuthenticated, principal, login, logout, and loading state to the app.",
  "frontend/src/context/ProContext.tsx": "React context for pro-specific state including profile data, active status, and wallet transfer cooldown timer.",
  "frontend/src/data/mockData.ts": "Re-exports demo pro types and data from demoData utils, and defines static mock objects for wallet transactions and radar booking requests.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useCarousel.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useCountingAnimation.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useGeolocation.ts": "Custom hook that requests the browser's geolocation, stores coordinates in sessionStorage, and exposes coordinates, loading, error state, and a requestPermission callback.",
  "frontend/src/hooks/useImageUpload.ts": "Custom React hook that handles image file uploads via drag-and-drop or file input, validating format (JPG/PNG/WebP) and size (max 5MB), then converting the file to base64 and invoking a callback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and context provider for Internet Computer Internet Identity authentication, managing login/logout state, identity persistence, and delegation validity checks using the DFINITY AuthClient.",
  "frontend/src/hooks/useParallax.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, pro profiles, location-based filtering, and booking CRUD operations (create, read, update status).",
  "frontend/src/hooks/useScrollReveal.ts": "Empty file with no implementation.",
  "frontend/src/index.css": "Global CSS file defining design tokens (CSS variables for colors, typography, spacing), base resets, app layout constraints, and a set of keyframe animations used throughout the UI.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/types/cropping.ts": "TypeScript type definitions for image cropping parameters (scale, offsets, dimensions) and a combined ImageData interface holding base64 data alongside optional crop params.",
  "frontend/src/utils/auraGenerator.ts": "Empty file with no implementation.",
  "frontend/src/utils/cityData.ts": "Utility module providing Swiss Romande city lists, approximate inter-city distances, and helper functions to compute proximity categories and filter cities within a given radius.",
  "frontend/src/utils/confetti.ts": "Utility function that programmatically creates a canvas overlay and animates golden confetti particles falling across the screen for 3 seconds, then removes the canvas.",
  "frontend/src/utils/demoData.ts": "Defines TypeScript interfaces and mock data for demo professionals (barbers, hairdressers, aestheticians, etc.) including their services with prices, durations, badges, and images.",
  "frontend/src/utils/haversine.ts": "Exports a `calculateDistance` function that computes the distance in kilometers between two GPS coordinates using the Haversine formula, rounded to one decimal place.",
  "frontend/src/utils/imageCompression.ts": "Provides utilities for measuring localStorage usage, compressing base64 images via canvas to JPEG, and calculating the byte size of a base64 string.",
  "frontend/src/utils/nominatim.ts": "Geocodes a city name to coordinates using the Nominatim API with localStorage caching, and provides a Haversine distance helper function.",
  "frontend/src/utils/servicePresets.ts": "Defines preset service lists (name, price, duration, badges) for categories Barber, Coiffure, Esthétique, and Massage, along with their TypeScript types.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters from both query strings and hash-based routing, persisting them in sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the NEXUS app, defining a dark-themed custom color palette, NEXUS-specific border radii, box shadows, and a rich set of custom animations and keyframes.",
  "project_state.json": "Tracks the project's architectural decisions, existing features, known issues, and new feature requests for the NEXUS pro-space React app, serving as a build-planning state document."
}