{
  "backend/main.mo": "Main Motoko actor for the NEXUS platform backend, managing user profiles, professional profiles, bookings, access control, blob storage, and Stripe configuration via included mixins and shared/query methods.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs and titles to their corresponding frontend source files, component dependencies, and test IDs for the NEXUS platform.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key implementation details of every component, utility, and configuration file in the project.",
  "frontend/index.css": "Root CSS file importing Tailwind directives and defining OKLCH-based CSS custom property tokens for light and dark themes covering background, foreground, card, border, chart, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the NEXUS platform, loading Google Fonts (Darker Grotesque, Inter, Playfair Display) and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that wraps the app in QueryClientProvider, AuthContextProvider, and AppContextProvider, renders ScreenRouter, and configures a dark-themed Sonner Toaster.",
  "frontend/src/AppV1.jsx": "Empty legacy file, previously the V1 QuickReveal application entry point, now unused.",
  "frontend/src/components/BookingContact.tsx": "Stub component that immediately redirects to the explorer screen, as it has been superseded by the BookingFlow component.",
  "frontend/src/components/BookingDate.tsx": "Stub component that immediately redirects to the explorer screen, as it has been superseded by the BookingFlow component.",
  "frontend/src/components/BookingFlow.tsx": "Multi-step booking flow component covering service selection, date/time picking, address entry, recap, payment (card fields), and confirmation with confetti animation, integrated with AppContext and AuthContext.",
  "frontend/src/components/BookingLocation.tsx": "Stub component that immediately redirects to the explorer screen, as it has been superseded by the BookingFlow component.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with four tabs (Explorer, Réservations, Messages, Profil) that navigates between screens based on app role, with an optional pulsing badge on the reservations tab for pending bookings.",
  "frontend/src/components/Builder.tsx": "Multi-step profile builder wizard for professionals, covering identity, payment (Revolut), services, gallery, availability, flash mode, and reputation steps, with publish validation and subscription flow.",
  "frontend/src/components/BuilderPreviewModal.tsx": "Full-screen modal that renders a read-only preview of a professional's profile (cover photo, logo, name, badges, bio, social links) as it would appear to clients.",
  "frontend/src/components/BuilderProgress.tsx": "Horizontal step-progress indicator component that displays numbered/labeled steps with completed (green check), current (gold), and future (dimmed) states connected by divider lines.",
  "frontend/src/components/ClientDashboard.tsx": "Client-facing dashboard that lists the user's bookings grouped by status (pending, confirmed, completed) with color-coded status badges, logout support, and a bottom navigation bar.",
  "frontend/src/components/ClientLogin.tsx": "Empty file with no content.",
  "frontend/src/components/CroppingModal.tsx": "Interactive image-cropping modal that lets users drag and zoom a photo within a fixed aspect-ratio frame, then saves the resulting crop parameters (scale, offsetX, offsetY) via a callback.",
  "frontend/src/components/Explorer.tsx": "Displays a browsable list of demo service providers (barbers, estheticians, etc.) with filtering by category and city, showing provider cards with ratings, pricing, and flash availability.",
  "frontend/src/components/GalleryPhotoUpload.tsx": "A gallery photo upload component that renders a grid of ImageUploader slots with a minimum photo count, supporting adding and removing photo slots.",
  "frontend/src/components/GlobalHeader.tsx": "A fixed top navigation header displaying the NEXUS logo, a notification bell with badge, and a user avatar with initials fetched from the user profile.",
  "frontend/src/components/ImageUploader.tsx": "An image upload component supporting drag-and-drop or file input, with validation, localStorage persistence, optional compression, and automatic cropping modal on upload.",
  "frontend/src/components/LandingPage.tsx": "A minimal landing page component that immediately redirects to the splash screen on mount.",
  "frontend/src/components/NexusOS.tsx": "The professional dashboard screen showing stats (pending bookings, earnings, rating) and tabbed sections (Radar, Wallet, Portfolio, Agenda) with logout functionality.",
  "frontend/src/components/NotificationCenter.tsx": "A notification bell button that opens a dropdown panel listing typed notifications (flash, payment, review, etc.) with timestamps and unread indicators.",
  "frontend/src/components/OTPVerification.tsx": "A two-step phone verification component that collects a phone number, simulates OTP sending, and verifies a hardcoded code ('1234') before saving the user profile as a client and navigating to the explorer screen.",
  "frontend/src/components/PaymentForm.tsx": "A credit card payment form component with fields for card number, expiry, and CVC, including formatting, validation logic, and a callback to notify the parent of validity and form data.",
  "frontend/src/components/ProLogin.tsx": "A simple professional login screen that triggers the auth login flow and provides a back button to return to the splash screen.",
  "frontend/src/components/ProOnboardingModal.tsx": "A bottom-sheet modal that presents the benefits of joining as a professional and, on confirmation, saves the user profile with the professional role and navigates to the profile builder screen.",
  "frontend/src/components/ProviderDetail.tsx": "A provider detail page that displays a hardcoded map of demo professional profiles (barber, esthetician, massage, hair) including their services, ratings, and bio.",
  "frontend/src/components/RadiusSimulator.tsx": "A visual radius selector component that renders an animated expanding circle and a range slider to let users choose a service radius up to 50 km.",
  "frontend/src/components/RoleSelection.tsx": "Renders a role selection screen where users choose between 'client' or 'professional' roles, triggering OTP verification for clients or a pro onboarding modal for professionals.",
  "frontend/src/components/ScreenRouter.tsx": "Routes between all app screens based on `currentScreen` context value, with a fade transition effect between screen changes.",
  "frontend/src/components/ServicePhotoUpload.tsx": "Provides a UI for uploading up to 5 service photos, with a required main photo slot and optional additional slots that can be added or removed.",
  "frontend/src/components/Splash.tsx": "Displays the app splash/login screen with Internet Identity authentication, redirecting users to the appropriate screen based on their saved profile role.",
  "frontend/src/components/Subscription.tsx": "A minimal component that immediately navigates to the 'subscription' screen on mount and renders nothing.",
  "frontend/src/components/SubscriptionScreen.tsx": "Displays a subscription activation screen offering a 7-day free trial, simulates payment processing with a countdown, and shows a success state with confetti on activation.",
  "frontend/src/components/SupportChat.tsx": "Implements a floating support chat widget with keyword-based auto-responses and quick action buttons for common support topics.",
  "frontend/src/components/UpgradeModal.tsx": "A modal dialog prompting users to upgrade to a professional account, listing benefits and providing 'Continue' and 'Cancel' buttons that navigate to the builder screen or close the modal.",
  "frontend/src/components/Welcome.tsx": "A welcome screen that lets new users optionally enter a display name, then creates their client profile via a mutation and navigates them to the explorer screen.",
  "frontend/src/context/AppContext.tsx": "Defines the global app context with navigation state, screen history, user role, pro profile, bookings, notifications, and wallet balances, exposing them via a React context provider.",
  "frontend/src/context/AuthContext.tsx": "Provides authentication context wrapping the Internet Identity hook, exposing login/logout handlers, authentication status, principal, and identity to child components.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useCarousel.ts": "Empty file with no content.",
  "frontend/src/hooks/useCountingAnimation.ts": "Empty file with no content.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty file with no content.",
  "frontend/src/hooks/useGeolocation.ts": "A hook that requests the browser's geolocation, stores coordinates in sessionStorage, and exposes loading/error state along with a requestPermission callback.",
  "frontend/src/hooks/useImageUpload.ts": "A hook that handles image file selection via drag-and-drop or file input, validates format and size, converts the file to base64, and exposes preview and error state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, managing login status, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useParallax.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including user profiles, pro profiles, location-based filtering, and booking operations using the ICP actor.",
  "frontend/src/hooks/useScrollReveal.ts": "Empty file, likely a placeholder for a scroll reveal animation hook.",
  "frontend/src/index.css": "Global CSS file defining Tailwind base/components/utilities, CSS custom properties for the NEXUS dark theme with gold accents, and reusable component classes like skeleton shimmer, button tap animations, and card hover effects.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider, InternetIdentityProvider, and the root App component.",
  "frontend/src/types/cropping.ts": "TypeScript interfaces defining crop parameters (scale, offsets, image data) and a combined ImageData type used for image cropping functionality.",
  "frontend/src/utils/auraGenerator.ts": "Empty file, likely a placeholder for an aura/visual effect generation utility.",
  "frontend/src/utils/cityData.ts": "Provides Swiss Romande city data including a city list, proximity zones, approximate inter-city distances in km, and utility functions for distance lookup, proximity categorization, and radius-based city filtering.",
  "frontend/src/utils/confetti.ts": "Implements a canvas-based golden confetti animation that spawns falling particles with randomized physics and fades out over 3 seconds.",
  "frontend/src/utils/demoData.ts": "Defines the DemoProProfile type and exports an array of hardcoded demo professional profiles (barbers, hairdressers, etc.) with services, pricing, and metadata for UI development and testing.",
  "frontend/src/utils/haversine.ts": "Exports a calculateDistance function that computes the distance in kilometers between two GPS coordinates using the Haversine formula.",
  "frontend/src/utils/imageCompression.ts": "Provides utilities to measure localStorage usage, compress a base64 image via canvas to JPEG, and calculate the byte size of a base64 string.",
  "frontend/src/utils/nominatim.ts": "Geocodes city/address strings using the Nominatim OpenStreetMap API with localStorage caching, and provides a haversine distance calculation function.",
  "frontend/src/utils/servicePresets.ts": "Defines preset service offerings grouped by category (Barber, Coiffure, Esthétique, Massage) with id, name, price, duration, and badges. Exports the presets map, a categories constant, and related TypeScript types.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the NEXUS frontend, extending the theme with custom NEXUS dark/gold/blue design tokens, Inter font, custom border radii, box shadows, and keyframe animations.",
  "project_state.json": "Tracks the overall NEXUS project state including version, architectural notes, known issues, and a list of implemented features with their requirements for the premium mobile service app redesign."
}