{
  "backend/main.mo": "Main actor for the NEXUS platform backend, defining data types (UserProfile, ProProfile, Booking, etc.) and CRUD endpoints for user profiles, pro profiles, bookings, and Stripe configuration, with access control enforcement.",
  "backend/migration.mo": "Defines the old and new actor state types for data migration; currently a no-op migration that returns the existing state unchanged.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs and titles to their corresponding frontend source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, serving as a reference index for the project's frontend components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, chart colors, etc.).",
  "frontend/index.html": "HTML entry point for the NEXUS platform, loading Google Fonts (Darker Grotesque, Inter, Playfair Display) and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that wraps the app with QueryClientProvider, AuthContextProvider, and AppContextProvider, rendering ScreenRouter and a styled Toaster notification component.",
  "frontend/src/AppV1.jsx": "Empty legacy file, previously the V1 application entry point with no current content.",
  "frontend/src/components/BookingContact.tsx": "Stub component that immediately redirects to the explorer screen, as it has been superseded by the BookingFlow component.",
  "frontend/src/components/BookingDate.tsx": "Stub component that immediately redirects to the explorer screen, as it has been superseded by the BookingFlow component.",
  "frontend/src/components/BookingFlow.tsx": "Multi-step booking flow component handling service selection, date/time picking, address entry, recap, payment (card fields), and confirmation with a confetti animation on success.",
  "frontend/src/components/BookingLocation.tsx": "Stub component that immediately redirects to the explorer screen, as it has been superseded by the BookingFlow component.",
  "frontend/src/components/Builder.tsx": "Multi-step pro profile builder component with steps for identity, payment, services, gallery, availability, flash mode, and reputation. Handles image uploads, service presets, validation, and transitions to a subscription screen on publish.",
  "frontend/src/components/BuilderPreviewModal.tsx": "Modal overlay that renders a full preview of a pro's builder profile data, including cover photo, logo, badges, bio, social media links, and services.",
  "frontend/src/components/BuilderProgress.tsx": "Displays a horizontal step-progress indicator for the Builder flow, showing completed, current, and future steps with labels and connecting lines.",
  "frontend/src/components/ClientDashboard.tsx": "Client-facing dashboard that lists the user's bookings grouped by status (pending, confirmed, cancelled) and shows toast notifications when booking status changes.",
  "frontend/src/components/ClientLogin.tsx": "Empty file with no content.",
  "frontend/src/components/CroppingModal.tsx": "Interactive image cropping modal supporting drag-to-pan and zoom controls for a given aspect ratio, saving crop parameters (scale, offset) on confirm.",
  "frontend/src/components/Explorer.tsx": "Explorer screen that displays a filterable, searchable grid of pro profile cards with distance, flash status, ratings, and skeleton loading states, allowing users to select a pro.",
  "frontend/src/components/GalleryPhotoUpload.tsx": "A grid-based gallery photo upload component that manages multiple image slots with a minimum count, allowing users to add or remove photo slots using the ImageUploader component.",
  "frontend/src/components/ImageUploader.tsx": "A reusable image upload component supporting drag-and-drop and file input, with localStorage persistence, compression, and automatic cropping modal on upload.",
  "frontend/src/components/LandingPage.tsx": "A minimal landing page component that immediately redirects to the 'splash' screen on mount using the app navigation context.",
  "frontend/src/components/NexusOS.tsx": "The professional dashboard (NexusOS) displaying booking management tabs (radar, wallet, portfolio, agenda) with accept/refuse actions, wallet balances, and trial status.",
  "frontend/src/components/NotificationCenter.tsx": "A notification bell component that displays a dropdown panel of typed notifications (flash, payment, review, etc.) with unread count badge and mark-all-read functionality.",
  "frontend/src/components/OTPVerification.tsx": "A two-step phone OTP verification flow (phone entry then code entry) that saves the user profile and navigates to the explorer screen upon successful verification.",
  "frontend/src/components/PaymentForm.tsx": "A credit card payment form with real-time validation and formatting for card number, expiry, and CVC fields, reporting validity and data to the parent via a callback.",
  "frontend/src/components/ProLogin.tsx": "Renders a professional login page with a login button that triggers auth flow and a back button to return to the splash screen.",
  "frontend/src/components/ProOnboardingModal.tsx": "Displays a bottom-sheet modal listing professional onboarding benefits and a CTA to start a 7-day free trial, saving the user's role as 'professional' and navigating to the builder screen.",
  "frontend/src/components/ProviderDetail.tsx": "Shows a detailed view of a service provider including a hero image, service list with selection, and a continue button that navigates to the booking flow with the selected service.",
  "frontend/src/components/RadiusSimulator.tsx": "An interactive radius selector component that visually displays a growing circle and a range slider to let users choose a service radius in kilometers (0–50 km).",
  "frontend/src/components/RoleSelection.tsx": "Presents role selection cards (client or professional) after login, routing clients through OTP verification or directly to the explorer, and professionals to the onboarding modal.",
  "frontend/src/components/ScreenRouter.tsx": "Central routing component that renders the appropriate screen component based on the current screen state from AppContext, covering all major app screens.",
  "frontend/src/components/ServicePhotoUpload.tsx": "Manages uploading up to 5 photos for a service, with a required main photo slot and optional additional slots that can be added or removed individually.",
  "frontend/src/components/Splash.tsx": "Landing splash screen that checks authentication state and user profile, then routes users to the appropriate screen (nexusOS, explorer, or roleSelection) based on their app role.",
  "frontend/src/components/Subscription.tsx": "Thin wrapper component that immediately navigates to the 'subscription' screen on mount and renders nothing.",
  "frontend/src/components/SubscriptionScreen.tsx": "Subscription activation screen offering a 7-day free trial for professionals, with email input, countdown processing animation, confetti on success, and navigation to the pro dashboard.",
  "frontend/src/components/SupportChat.tsx": "Floating chat widget with a keyword-based auto-response system that simulates a support agent, including quick-action buttons and a typing indicator.",
  "frontend/src/components/UpgradeModal.tsx": "Modal dialog prompting users to upgrade to a professional account, listing benefits and navigating to the 'builder' screen on confirmation.",
  "frontend/src/components/Welcome.tsx": "Onboarding screen that lets new users optionally set a display name, then creates their client profile via a backend mutation and navigates to the explorer.",
  "frontend/src/context/AppContext.tsx": "Central React context providing global app state including current screen, navigation history, user role, pro profile, bookings, notifications, and wallet balances.",
  "frontend/src/context/AuthContext.tsx": "Provides a React authentication context wrapping Internet Identity, exposing login/logout handlers, authentication state, and principal. Includes both a deprecated `useAuthContext` and a current `useAuth` hook.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing it when the user's identity changes and invalidating dependent queries accordingly.",
  "frontend/src/hooks/useCarousel.ts": "Empty file with no content.",
  "frontend/src/hooks/useCountingAnimation.ts": "Empty file with no content.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty file with no content.",
  "frontend/src/hooks/useGeolocation.ts": "Hook that requests the browser's geolocation, stores coordinates in sessionStorage, and exposes loading/error state along with a `requestPermission` callback.",
  "frontend/src/hooks/useImageUpload.ts": "Hook that handles image file selection via drag-and-drop or file input, validates format (JPEG/PNG/WebP) and size (≤5 MB), converts to base64, and exposes preview and error state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, managing login/logout lifecycle, identity persistence, and exposing status flags via React context.",
  "frontend/src/hooks/useParallax.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for backend interactions including user profile CRUD, pro profile lookup, and booking creation/retrieval/status updates via the ICP actor.",
  "frontend/src/hooks/useScrollReveal.ts": "Empty file with no content.",
  "frontend/src/index.css": "Global stylesheet defining CSS custom properties for a dark theme, Tailwind base/components/utilities imports, custom utility classes, and keyframe animations (shimmer, pulse, countdown).",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/types/cropping.ts": "Defines TypeScript interfaces for image crop parameters (scale, offsets, dimensions) and a combined ImageData type holding base64 data with optional crop params.",
  "frontend/src/utils/auraGenerator.ts": "Empty file with no content.",
  "frontend/src/utils/cityData.ts": "Defines Swiss Romande cities, their proximity zones, and approximate inter-city distances in km, with helper functions to calculate distance, proximity category, cities within a radius, and formatted distance strings.",
  "frontend/src/utils/confetti.ts": "Exports a single function that creates a full-screen canvas overlay and animates 120 golden confetti particles falling and fading over 3 seconds.",
  "frontend/src/utils/demoData.ts": "Defines the DemoProProfile type and exports an array of hardcoded demo service-provider profiles (barbers, hairdressers, etc.) with services, ratings, and location data for Swiss Romande cities.",
  "frontend/src/utils/haversine.ts": "Exports a calculateDistance function that computes the distance in kilometers between two GPS coordinates using the Haversine formula, rounded to one decimal place.",
  "frontend/src/utils/imageCompression.ts": "Provides utilities to measure localStorage usage in bytes, compress a base64 image via canvas to JPEG at a given quality, and calculate the byte size of a base64 string.",
  "frontend/src/utils/nominatim.ts": "Geocodes a city name string via the Nominatim OpenStreetMap API with localStorage caching, and provides a standalone Haversine distance function for lat/lon pairs.",
  "frontend/src/utils/servicePresets.ts": "Defines preset service lists (name, price, duration, badges) for four beauty/wellness categories—Barber, Coiffure, Esthétique, and Massage—and exports the category type.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read URL query parameters from both regular and hash-based routes, persist them in sessionStorage, and clean sensitive parameters from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with NEXUS-specific color tokens, custom fonts, border radii, box shadows, and keyframe animations including flash-pulse, shimmer, and red-pulse.",
  "project_state.json": "Defines the NEXUS Platform v2.0 project state including architecture notes, design tokens, feature inventory, and image requirements for a Swiss home-services booking app built on ICP/Motoko with React frontend. Tracks 11 feature blocs, 6 demo pro profiles, and known issues across schema version 1.0.0."
}