{
  "backend/main.mo": "Main ICP actor implementing the NEXUS backend with user/pro profile management, booking CRUD, Stripe configuration, and access-controlled endpoints using Motoko core libraries and custom mixins for storage and authorization.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs (Payrexx integration, Twilio OTP, frontend architecture refactor, etc.) to their associated files, components, test IDs, and confidence levels for build planning.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key implementation details of components, utilities, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS entry file defining shadcn-compatible CSS custom property tokens for light and dark themes, including colors, radius, chart colors, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the NEXUS app, loading Inter font from Google Fonts with viewport-fit=cover for iOS safe areas and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the app in QueryClientProvider, AuthContextProvider, and AppContextProvider, with a fixed full-screen dark background container constrained to 430px and a Sonner Toaster.",
  "frontend/src/AppV1.jsx": "Empty legacy file, previously the complete QuickReveal application with three views and localStorage persistence.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component with tabbed views for professionals, bookings, and metrics, using custom query hooks and a validate-pro mutation, styled with NEXUS design tokens.",
  "frontend/src/components/BookingContact.tsx": "A form component for collecting client contact details (name, phone, address) during booking, with a simulated async submission that shows a success state and redirects to the explorer.",
  "frontend/src/components/BookingDate.tsx": "A date and time selection screen for booking, allowing users to pick from day pills and a grid of time slots before proceeding to the booking flow.",
  "frontend/src/components/BookingFlow.tsx": "A multi-step booking wizard (5 steps: service, location, date/time, contact info, confirmation) that collects all booking details and creates a booking entry before navigating to the live status screen.",
  "frontend/src/components/BookingLocation.tsx": "A simple screen for selecting the service location (at home or in studio) as part of the booking flow, with a continue button navigating to the booking flow.",
  "frontend/src/components/BottomNav.tsx": "A bottom navigation bar with four tabs (Explorer, Réservations, Alertes, Profil) that highlights the active tab and shows a badge dot on the bookings tab when there are pending bookings.",
  "frontend/src/components/Builder.tsx": "A two-step profile creation form for professionals, collecting basic info (name, city, category, bio) and services, then constructing a DemoPro object and navigating to the pro profile page.",
  "frontend/src/components/BuilderPreviewModal.tsx": "A modal overlay component that renders a full preview of a studio/artist profile page, displaying cover photo, logo, name, badges, bio, social media links, and other profile data passed via props.",
  "frontend/src/components/BuilderProgress.tsx": "A step progress indicator component that displays numbered steps with labels, marking completed steps with a checkmark and highlighting the current step.",
  "frontend/src/components/BusinessScreen.tsx": "A multi-tab business profile management screen for pros, allowing editing of profile info, services, pricing, payment (IBAN), and gallery, with a completion percentage tracker and preview mode.",
  "frontend/src/components/CircularProgress.tsx": "A reusable SVG-based circular progress indicator that displays a percentage value with configurable size, colors, and stroke width.",
  "frontend/src/components/ClientDashboard.tsx": "A client-facing dashboard screen that lists pending and confirmed bookings, with an empty state prompt to explore services.",
  "frontend/src/components/ClientLogin.tsx": "An empty file with no content.",
  "frontend/src/components/Confetti.tsx": "A decorative component that renders 30 randomly positioned and colored confetti particles falling via CSS animation, used as a celebration effect.",
  "frontend/src/components/CroppingModal.tsx": "A modal for interactively cropping images by dragging and zooming, supporting configurable aspect ratios and saving crop parameters (scale, offset) for later use.",
  "frontend/src/components/DashboardScreen.tsx": "Displays a pro dashboard with stats cards (confirmed bookings, revenue, acceptance rate, profile status) fetched via React Query hooks, and shows an activation banner if the pro profile is inactive.",
  "frontend/src/components/Explorer.tsx": "Explorer screen that fetches active and flash pros from the backend, filters them by category and search query, and renders a scrollable list with a bottom nav.",
  "frontend/src/components/ExplorerPreview.tsx": "Modal overlay that shows a read-only preview of how a pro profile appears in the Explorer, including cover photo, avatar, location, and normalised service list.",
  "frontend/src/components/ExplorerV2.tsx": "Alternative Explorer screen using static demo data, with search input, category filter pills, and separate sections for flash and regular pros.",
  "frontend/src/components/GalleryPhotoUpload.tsx": "Gallery photo upload component that manages a dynamic list of image slots (minimum enforced), allowing adding, removing, and updating photos via the ImageUploader component.",
  "frontend/src/components/GlobalHeader.tsx": "Fixed top header showing the NEXUS logo, a notification bell with unread badge, and a user avatar; also renders a slide-in NotificationPanel when the bell is clicked.",
  "frontend/src/components/icons/Icons.tsx": "Exports a collection of reusable SVG icon components (Flash, Search, Check, X, Bell, Radar, Wallet, Dashboard, Business, Star, Lock, etc.) with configurable size and color props.",
  "frontend/src/components/icons/index.tsx": "Defines a `makeIcon` factory that creates SVG icon components from raw path strings, then exports a collection of named icons (Flash, Search, Check, Arrow variants, etc.).",
  "frontend/src/components/ImageUploader.tsx": "A React component for uploading, validating, and cropping images with drag-and-drop support, localStorage persistence, and optional compression when storage is near capacity.",
  "frontend/src/components/LandingPage.tsx": "A minimal dark-themed landing page for the NEXUS app that displays the brand name and a button to navigate to the splash screen.",
  "frontend/src/components/LiveStatus.tsx": "A live booking status screen showing an elapsed-time counter and a multi-step timeline tracking the progress of a service reservation.",
  "frontend/src/components/Login.tsx": "A login screen using Internet Identity authentication that redirects users to their role-appropriate page after successful login.",
  "frontend/src/components/MessagingSheet.tsx": "A bottom-sheet messaging UI between a client and a pro, with simulated auto-replies and a scrollable message list.",
  "frontend/src/components/MonBusiness.tsx": "A thin wrapper component that renders ProLayout for the 'Mon Business' section of the app.",
  "frontend/src/components/NexusOS.tsx": "A thin wrapper component that renders ProLayout for the NexusOS section of the app.",
  "frontend/src/components/NotificationCenter.tsx": "A full-screen notification center that lists app notifications with read/unread states and a mark-all-read action.",
  "frontend/src/components/OTPVerification.tsx": "A 4-digit OTP verification screen that accepts the hardcoded demo code '1234', then sets the app role to 'client' and navigates to the explorer. Includes auto-focus, digit-by-digit input handling, error display, and a resend option.",
  "frontend/src/components/OTPVerificationV2.tsx": "An alternate OTP verification screen (V2 styling) with paste support, back navigation, and the same '1234' demo code logic that navigates to 'explorerV2' on success.",
  "frontend/src/components/PaymentForm.tsx": "A credit card payment form component with fields for card number, expiry, and CVC, including formatting, validation, and a callback to notify the parent of validity and form data.",
  "frontend/src/components/ProApp.tsx": "A thin wrapper component that renders ProLayout as the root of the pro-side application.",
  "frontend/src/components/ProDashboard.tsx": "A redirect component that immediately navigates to 'nexusOS' on mount, acting as an alias for the NexusOS screen.",
  "frontend/src/components/ProErrorBoundary.tsx": "A React class-based error boundary that catches runtime errors in the pro app and displays a styled fallback UI with a retry button.",
  "frontend/src/components/ProFiche.tsx": "A pro profile detail page showing cover image, info, and tabbed sections (services, gallery, reviews) with a back button and flash offer badge, using selectedPro from context.",
  "frontend/src/components/ProLayout.tsx": "The main layout shell for the pro app, managing tab navigation between Radar, Wallet, Dashboard, and Business screens, and overlaying subscription modals wrapped in ProProvider and ProErrorBoundary.",
  "frontend/src/components/ProLogin.tsx": "Renders the professional login page using Internet Identity, then redirects to 'nexusOS' if a pro profile exists or 'builder' if not.",
  "frontend/src/components/ProOnboardingModal.tsx": "Displays a bottom-sheet modal listing NEXUS Pro benefits (visibility, bookings, payments, analytics, notifications) with a call-to-action to start a 7-day free trial.",
  "frontend/src/components/ProProfile.tsx": "Shows a detailed public profile page for a selected professional, including an animated cover, stats (rating, reviews), and a list of services.",
  "frontend/src/components/ProSubscriptionModal.tsx": "Full-screen subscription flow modal where a pro enters their email to activate a 7-day free trial, then redirects to 'nexusOS' on success.",
  "frontend/src/components/ProTabBar.tsx": "Renders a bottom tab bar for the pro dashboard with four tabs: Radar, Wallet, Dashboard, and Business, highlighting the active tab in gold.",
  "frontend/src/components/ProviderDetail.tsx": "Displays a scrollable provider detail page with a cover image, profile info, and tabbed sections for services, gallery, and reviews, with a back button and Flash badge.",
  "frontend/src/components/RadarPro.tsx": "A professional dashboard component that displays real-time booking requests, allowing pros to filter bookings by status (pending, confirmed, history) and accept or decline them.",
  "frontend/src/components/RadiusSimulator.tsx": "A visual radius selector component that renders an animated expanding circle and a range slider to let users choose a search radius up to 50 km.",
  "frontend/src/components/RoleSelection.tsx": "A role selection screen where users choose between 'Client' and 'Professionnel' profiles, then navigate to the appropriate onboarding flow.",
  "frontend/src/components/RoleSelectionV2.tsx": "An updated role selection screen (V2) with icon-enhanced cards for Client and Pro roles, setting the app role in context and navigating accordingly or rendering ProApp directly.",
  "frontend/src/components/ScreenRouter.tsx": "The main routing component that lazily loads and renders the correct screen component based on the current screen value from AppContext, with a spinner fallback.",
  "frontend/src/components/ServiceEditor.tsx": "A bottom-sheet modal form component for creating or editing a service item, with fields for name, price, duration, category, badge, and mode.",
  "frontend/src/components/ServicePhotoUpload.tsx": "A photo upload manager for a service, supporting one main photo and up to four additional photos with add/remove slot controls using ImageUploader.",
  "frontend/src/components/SMSToast.tsx": "An animated toast notification component that displays an SMS-sent confirmation with phone number and message, auto-dismissing after ~4 seconds; includes a commented-out Twilio integration stub with security warnings.",
  "frontend/src/components/Splash.tsx": "The app's splash/landing screen displaying the NEXUS logo, tagline, and animated ambient orbs, with a button to navigate to role selection.",
  "frontend/src/components/Subscription.tsx": "A subscription upsell screen listing pro benefits with a 7-day free trial offer and a button to start the trial or skip.",
  "frontend/src/components/SubscriptionModal.tsx": "A bottom-sheet modal presenting the Pro subscription pricing (199 CHF/year with a 7-day trial) and benefits, with a subscribe action button.",
  "frontend/src/components/SubscriptionScreen.tsx": "A full-screen subscription activation page that lists pro benefits and activates a 7-day free trial via app context when the user confirms.",
  "frontend/src/components/SubscriptionSuccess.tsx": "Displays a full-screen subscription activation overlay with a progress bar, loading spinner, and a success checkmark with confetti animation, then calls onComplete after 4.5 seconds.",
  "frontend/src/components/SupportChat.tsx": "Renders a floating chat widget with a support assistant that provides keyword-based auto-responses and quick action shortcuts for common user issues.",
  "frontend/src/components/UpgradeModal.tsx": "Modal dialog prompting users to upgrade to a Pro account, listing key benefits and triggering upgradeToProAccount from AppContext on confirmation.",
  "frontend/src/components/WalletPro.tsx": "Displays the professional user's wallet balance in CHF fetched via React Query and provides a transfer button with a 30-second cooldown after initiating a payout.",
  "frontend/src/components/Welcome.tsx": "Onboarding screen that collects the user's first name, sets the app role to 'client', and navigates to the explorer view.",
  "frontend/src/context/AppContext.tsx": "Defines the global AppContext with types and state for navigation screens, user roles, pro profiles, bookings, wallet, subscriptions, notifications, and flash mode across the app.",
  "frontend/src/context/AuthContext.tsx": "Provides an AuthContext wrapping `useInternetIdentity` to expose authentication state (principal, identity, login/logout) and handles the already-authenticated edge case.",
  "frontend/src/context/ProContext.tsx": "Provides ProContext with state for the pro's active status, profile data (services, photos, bio, etc.), and wallet cooldown timer.",
  "frontend/src/data/mockData.ts": "Re-exports demo pro types and data from `demoData` utils, and defines static mock wallet and radar data used for UI prototyping.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) via React Query, reinitializing and invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useCarousel.ts": "Empty file with no content.",
  "frontend/src/hooks/useCountingAnimation.ts": "Empty file with no content.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty file with no content.",
  "frontend/src/hooks/useGeolocation.ts": "Hook that requests the browser's geolocation, stores coordinates in sessionStorage, and exposes loading/error state along with a `requestPermission` callback.",
  "frontend/src/hooks/useImageUpload.ts": "Hook that handles image file selection via drag-and-drop or file input, validates format and size, converts to base64, and exposes preview/error/uploading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, including login, logout, and identity state management using DFINITY's AuthClient.",
  "frontend/src/hooks/useParallax.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user/pro profiles, bookings, services, availability, gallery, and admin operations.",
  "frontend/src/hooks/useScrollReveal.ts": "Empty file with no content.",
  "frontend/src/index.css": "Global CSS file defining design tokens (CSS variables), base resets, layout, scrollbar styles, and keyframe animations for the app.",
  "frontend/src/lib/notifications.ts": "Utility library for managing in-app notifications stored in localStorage, with functions to get, save, add, and mark notifications as read.",
  "frontend/src/lib/payrexx.ts": "Client-side library for creating Payrexx payment gateway URLs for both pro subscriptions and booking payments via the Payrexx API.",
  "frontend/src/lib/twilio.ts": "Utility functions for sending and verifying OTP codes via a Cloudflare Worker proxy to Twilio.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/screens/admin/AdminDashboardScreen.tsx": "Admin dashboard screen with tabbed navigation showing metrics, pro profiles, bookings, and revenue data with pro validation functionality.",
  "frontend/src/screens/admin/AdminLoginScreen.tsx": "Admin login screen that validates email/password credentials against values stored in localStorage, showing a shield icon and back navigation.",
  "frontend/src/screens/auth/LoginScreen.tsx": "Internet Identity login screen with animated background orbs and a single login button that triggers the ICP authentication flow.",
  "frontend/src/screens/auth/OTPScreen.tsx": "Two-step phone OTP screen that sends an SMS via Twilio, then collects a 6-digit code with auto-advance inputs and a resend cooldown timer.",
  "frontend/src/screens/auth/RoleScreen.tsx": "Role selection screen presenting Client, Professional, and Admin options as styled cards with icons and feature tags.",
  "frontend/src/screens/client/AlertesScreen.tsx": "Client notifications screen that lists in-app alerts from the notifications library with mark-as-read functionality per item or all at once.",
  "frontend/src/screens/client/ClientProfilScreen.tsx": "Displays the client profile screen with user avatar, personal info, settings options, and a logout button that clears identity and query cache.",
  "frontend/src/screens/client/ExplorerScreen.tsx": "Shows a searchable, category-filtered list of professional profiles fetched by location, with a search bar, category pills, and pro cards.",
  "frontend/src/screens/client/ReservationsScreen.tsx": "Lists a client's bookings fetched by principal, showing status badges and allowing navigation to booking details or the explorer screen.",
  "frontend/src/screens/pro/ProDashboardScreen.tsx": "Renders the professional's home dashboard with booking stats (pending, confirmed, revenue, total) and a recent bookings list, plus a subscription modal trigger.",
  "frontend/src/screens/pro/ProRadarScreen.tsx": "Displays incoming bookings for a professional with filter tabs (pending/confirmed/all) and accept/decline actions that update booking status via mutation.",
  "frontend/src/screens/pro/SubscriptionModal.tsx": "A bottom-sheet modal component for NEXUS Pro subscription that collects email and phone, then redirects to a Payrexx payment URL for a 19.90 CHF/month plan with a 7-day free trial.",
  "frontend/src/screens/pro/SuccessScreen.tsx": "A full-screen success screen shown after subscription activation, displaying a loading progress bar followed by a success state with confetti animation and a continue button.",
  "frontend/src/screens/SetupScreen.tsx": "Initial setup screen that collects Payrexx, Worker URL, and admin credentials, saving them to localStorage before marking setup as complete.",
  "frontend/src/state/useAppState.ts": "A React hook that manages global application state including screen navigation, user/booking data, roles, and toast notifications, with helper methods like go, goBack, update, and showToast.",
  "frontend/src/types/cropping.ts": "TypeScript interfaces defining crop parameters (scale, offsets, base64 image, dimensions) and image data structure used for image cropping functionality.",
  "frontend/src/utils/auraGenerator.ts": "An empty utility file with no content.",
  "frontend/src/utils/cityData.ts": "Defines Swiss Romande cities, their proximity zones, approximate inter-city distances in km, and utility functions for calculating distance, proximity category, and filtering cities within a radius.",
  "frontend/src/utils/confetti.ts": "Renders an animated golden confetti effect on a temporary canvas overlay using requestAnimationFrame, auto-removing after 3 seconds.",
  "frontend/src/utils/demoData.ts": "Defines TypeScript interfaces and static demo data for professionals (barbers, hairdressers, estheticians) and their services, including prices, durations, images, and metadata.",
  "frontend/src/utils/haversine.ts": "Exports a calculateDistance function that computes the distance in kilometers between two GPS coordinates using the Haversine formula, rounded to one decimal place.",
  "frontend/src/utils/imageCompression.ts": "Provides utilities for compressing base64 images via canvas (JPEG output), calculating base64 string size in bytes, and measuring total localStorage usage.",
  "frontend/src/utils/nominatim.ts": "Geocodes city name strings using the Nominatim OpenStreetMap API with localStorage caching, and computes the haversine distance between two lat/lon coordinates.",
  "frontend/src/utils/servicePresets.ts": "Defines preset service offerings (name, price, duration, badges) for four beauty categories (Barber, Coiffure, Esthétique, Massage) and exports their types and category list.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, persisting them in sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the NEXUS frontend, defining a dark-themed custom color palette, NEXUS-specific border radii, box shadows, and a rich set of named keyframe animations.",
  "project_state.json": "Tracks the overall NEXUS v8.0 project state including architecture notes, known issues, and a registry of implemented features with their requirement IDs and versions."
}