{
  "backend/main.mo": "Main ICP actor defining data types (UserProfile, ProProfile, Booking, etc.) and canister methods for user/pro profile management, bookings, Stripe configuration, and access-controlled admin operations. Includes blob storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to their target files, related components, and test IDs, covering frontend integration tasks like replacing mock data with real canister calls, implementing Internet Identity auth, and connecting pro/client dashboards to the backend.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing each component's purpose, key UI elements, and notable implementation details for build planning reference.",
  "frontend/index.css": "Global CSS entry point importing Tailwind layers and defining shadcn/ui CSS custom properties (color tokens, radius, sidebar variables) for both light and dark themes.",
  "frontend/index.html": "HTML entry point for the NEXUS app, loading Inter font from Google Fonts, setting viewport-fit=cover for iOS, and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the app in QueryClientProvider, AuthContextProvider, and AppContextProvider, with a fixed full-screen layout constrained to 430px and a Sonner Toaster.",
  "frontend/src/AppV1.jsx": "Empty legacy file, previously the complete QuickReveal/NEXUS v1 application with three views and localStorage persistence.",
  "frontend/src/components/AdminPanel.tsx": "Admin panel component with tabs for professionals, bookings, and metrics, using React Query hooks (useAdminAllPros, useAdminAllBookings, useAdminMetrics, useAdminValidatePro) to display and manage canister data.",
  "frontend/src/components/BookingContact.tsx": "A form component for collecting client contact details (name, phone, address) during booking, showing a success state and redirecting to the explorer screen after confirmation.",
  "frontend/src/components/BookingDate.tsx": "A date and time selection screen for booking, allowing users to pick from day pills and time slot grid before proceeding to the booking flow.",
  "frontend/src/components/BookingFlow.tsx": "A multi-step booking wizard (5 steps: service, location, date/time, contact info, confirmation) that assembles a booking object and navigates to the live status screen on completion.",
  "frontend/src/components/BookingLocation.tsx": "A simple screen for selecting the service location (at home or in studio) as part of the booking flow, with a continue button navigating to bookingFlow.",
  "frontend/src/components/BottomNav.tsx": "A bottom navigation bar with four tabs (Explorer, Réservations, Alertes, Profil) that highlights the active tab and shows a badge dot for pending bookings.",
  "frontend/src/components/Builder.tsx": "A two-step profile creation form for professionals, collecting basic info and services, then constructing a DemoPro object and navigating to the pro profile screen.",
  "frontend/src/components/BuilderPreviewModal.tsx": "A modal overlay component that renders a full preview of a studio/artist profile page, displaying cover photo, logo, name, badges, bio, and social media links using provided form data.",
  "frontend/src/components/BuilderProgress.tsx": "A step progress indicator component that displays numbered steps with labels, marking completed steps with a checkmark and highlighting the current step.",
  "frontend/src/components/BusinessScreen.tsx": "A multi-tab business profile management screen for pros, allowing editing of profile info, services, payment (IBAN), and displaying a completion percentage via CircularProgress.",
  "frontend/src/components/CircularProgress.tsx": "A reusable SVG-based circular progress indicator that displays a percentage value with configurable size, colors, and stroke width.",
  "frontend/src/components/ClientDashboard.tsx": "A client-facing dashboard screen that lists pending and confirmed bookings, with an empty state prompt to navigate to the explorer.",
  "frontend/src/components/ClientLogin.tsx": "An empty file with no content.",
  "frontend/src/components/Confetti.tsx": "A decorative component that renders 30 randomly positioned and colored particles falling with a CSS animation to create a confetti effect.",
  "frontend/src/components/CroppingModal.tsx": "A modal image cropping tool that lets users drag and zoom an image within a fixed aspect-ratio frame, saving crop parameters (scale, offsets) on confirmation.",
  "frontend/src/components/DashboardScreen.tsx": "Displays a pro dashboard with stats cards (confirmed bookings, revenue, acceptance rate, profile status) fetched via React Query hooks, and shows an activation banner if the pro profile is inactive.",
  "frontend/src/components/Explorer.tsx": "Explorer screen that fetches active and flash pros from the backend, filters them by category and search query, and renders them in a scrollable list with a bottom nav.",
  "frontend/src/components/ExplorerPreview.tsx": "Modal overlay that shows a read-only preview of how a pro profile will appear in the Explorer, including cover photo, avatar, services list, and location type.",
  "frontend/src/components/ExplorerV2.tsx": "Alternative Explorer screen using static demo data (DEMO_PROS), with search, category filters, and separate sections for flash and regular pros.",
  "frontend/src/components/GalleryPhotoUpload.tsx": "Gallery photo upload component that manages a dynamic list of image slots (minimum enforced), allowing adding, removing, and uploading individual photos via ImageUploader.",
  "frontend/src/components/GlobalHeader.tsx": "Fixed top header showing the NEXUS logo, a notification bell with unread badge, and a user avatar; includes a slide-in NotificationPanel for viewing and marking notifications.",
  "frontend/src/components/icons/Icons.tsx": "Library of reusable SVG icon components (Flash, Search, Check, X, Bell, Radar, Wallet, Dashboard, Business, Star, Lock, etc.) accepting size, color, and className props.",
  "frontend/src/components/ImageUploader.tsx": "A React component for uploading, validating, compressing, and cropping images with drag-and-drop support, persisting results to localStorage via a configurable storage key.",
  "frontend/src/components/LandingPage.tsx": "A minimal dark-themed landing page for the NEXUS app that displays the brand name and a 'Commencer' button navigating to the splash screen.",
  "frontend/src/components/LiveStatus.tsx": "Displays a real-time booking status screen with an elapsed-time counter and a multi-step timeline showing the progress of a service booking.",
  "frontend/src/components/Login.tsx": "Login screen that authenticates users via Internet Identity, then redirects to the NexusOS or role-selection page based on whether a user profile exists.",
  "frontend/src/components/MessagingSheet.tsx": "A bottom-sheet messaging UI between a client and a pro, with a pre-seeded conversation, message sending, and simulated auto-replies.",
  "frontend/src/components/MonBusiness.tsx": "A thin wrapper component that renders ProLayout for the 'Mon Business' section of the app.",
  "frontend/src/components/NexusOS.tsx": "A thin wrapper component that renders ProLayout as the main NexusOS view.",
  "frontend/src/components/NotificationCenter.tsx": "A full-screen notification center that lists app notifications with read/unread states and provides a 'mark all read' action.",
  "frontend/src/components/OTPVerification.tsx": "A 4-digit OTP verification screen that accepts digit input, auto-advances focus, and on correct code ('1234') sets the app role to 'client' and navigates to the explorer view.",
  "frontend/src/components/OTPVerificationV2.tsx": "An alternate OTP verification screen (V2) with paste support, a back button, and on correct code ('1234') navigates to 'explorerV2'.",
  "frontend/src/components/PaymentForm.tsx": "A credit card payment form component with fields for card number, expiry, and CVC that validates input and reports validity and data via an onValidationChange callback.",
  "frontend/src/components/ProApp.tsx": "A thin wrapper component that renders ProLayout as the root of the pro-side application.",
  "frontend/src/components/ProDashboard.tsx": "A redirect component that immediately navigates to 'nexusOS' on mount, rendering nothing itself.",
  "frontend/src/components/ProErrorBoundary.tsx": "A React class-based error boundary that catches crashes in the pro app and displays a styled error UI with a retry button.",
  "frontend/src/components/ProFiche.tsx": "A professional profile detail page showing cover image, info, and tabbed sections (services, gallery, reviews) with a back button and flash offer badge.",
  "frontend/src/components/ProLayout.tsx": "The main layout shell for the pro app that manages tab navigation (radar, wallet, dashboard, business) and overlays for subscription modal and success screen, wrapped in ProProvider and ProErrorBoundary.",
  "frontend/src/components/ProLogin.tsx": "Renders the professional login page using Internet Identity, redirecting authenticated users to either the NexusOS dashboard or the builder based on whether they have an existing pro profile.",
  "frontend/src/components/ProOnboardingModal.tsx": "A bottom-sheet modal that introduces new professionals to NEXUS Pro, listing key benefits (visibility, bookings, payments, analytics, notifications) and prompting them to start a 7-day free trial.",
  "frontend/src/components/ProProfile.tsx": "Displays a professional's public profile page with an animated cover, stats (rating, reviews), and a list of services, with a back button navigating to the explorer.",
  "frontend/src/components/ProSubscriptionModal.tsx": "A full-screen subscription flow modal where professionals enter their email to activate a 7-day free trial, then shows a success screen and redirects to NexusOS upon completion.",
  "frontend/src/components/ProTabBar.tsx": "A bottom tab bar component for the pro dashboard with four tabs (Radar, Wallet, Dashboard, Business), highlighting the active tab in gold.",
  "frontend/src/components/ProviderDetail.tsx": "Displays a detailed provider profile page with a cover image, back navigation, flash badge, and tabbed sections for services, gallery, and reviews.",
  "frontend/src/components/RadarPro.tsx": "A professional dashboard component that displays real-time booking requests, allowing pros to filter bookings by status (pending, confirmed, history) and accept or decline them.",
  "frontend/src/components/RadiusSimulator.tsx": "A visual radius selector component that renders an animated expanding circle and a range slider to let users choose a search radius up to 50 km.",
  "frontend/src/components/RoleSelection.tsx": "A role selection screen where users choose between 'Client' and 'Professionnel' profiles, then navigate to the appropriate onboarding flow.",
  "frontend/src/components/RoleSelectionV2.tsx": "An updated role selection screen (V2) with icon-enhanced cards for Client and Pro roles, setting the app role in context and navigating accordingly or rendering ProApp directly.",
  "frontend/src/components/ScreenRouter.tsx": "The central routing component that lazily loads and renders the correct screen component based on the current screen value from AppContext, with a spinner fallback.",
  "frontend/src/components/ServiceEditor.tsx": "A bottom-sheet modal form component for creating or editing a service item, with fields for name, price, duration, category, badge, and mode.",
  "frontend/src/components/ServicePhotoUpload.tsx": "A photo upload manager for a service, supporting up to 5 photos with a required main photo slot and removable additional photo slots.",
  "frontend/src/components/SMSToast.tsx": "An animated toast notification component that displays an SMS-sent confirmation with phone number and message, auto-dismissing after ~4 seconds; includes a commented-out Twilio integration stub with security warnings.",
  "frontend/src/components/Splash.tsx": "The app's splash/landing screen displaying the NEXUS logo, tagline, and a connect button that navigates to role selection, with animated ambient orb decorations.",
  "frontend/src/components/Subscription.tsx": "A subscription page listing professional plan benefits with a 7-day free trial offer and a button to start the trial or skip.",
  "frontend/src/components/SubscriptionModal.tsx": "A bottom-sheet modal presenting the Pro subscription pricing (199 CHF/year with a 7-day free trial) and benefits, with a subscribe button that simulates an async action.",
  "frontend/src/components/SubscriptionScreen.tsx": "A full-screen subscription activation page that activates the subscription in app context, adds a notification, and navigates to the main OS view.",
  "frontend/src/components/SubscriptionSuccess.tsx": "Full-screen overlay component that shows a loading progress bar for 2 seconds, then transitions to a success animation with confetti before calling an onComplete callback at 4.5 seconds.",
  "frontend/src/components/SupportChat.tsx": "Floating chat widget that provides keyword-based auto-responses to user messages, with quick-action buttons and a typing indicator, rendered as a fixed bottom-right overlay.",
  "frontend/src/components/UpgradeModal.tsx": "Modal dialog prompting users to upgrade to a Pro account, listing key benefits and triggering the upgradeToProAccount context action on confirmation.",
  "frontend/src/components/WalletPro.tsx": "Pro wallet dashboard displaying the user's available CHF balance fetched via React Query, with a transfer button that triggers a 30-second cooldown and sends a notification.",
  "frontend/src/components/Welcome.tsx": "Onboarding screen that collects the user's first name, sets the app role to 'client', and navigates to the explorer view, with an option to skip name entry.",
  "frontend/src/context/AppContext.tsx": "Defines the global AppContext with types and state for navigation screens, user roles, bookings, wallet, subscriptions, notifications, and pro profiles, exposing them via a React context provider.",
  "frontend/src/context/AuthContext.tsx": "Wraps the useInternetIdentity hook in a React context to expose authentication state (identity, principal, login/logout) to the component tree.",
  "frontend/src/context/ProContext.tsx": "Provides a React context for pro-specific state including profile data, active status, and wallet cooldown, with default values for a barber profile.",
  "frontend/src/data/mockData.ts": "Re-exports demo pro data from demoData utils and defines static mock data for wallet transactions and radar booking requests.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useCarousel.ts": "Empty file with no content.",
  "frontend/src/hooks/useCountingAnimation.ts": "Empty file with no content.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty file with no content.",
  "frontend/src/hooks/useGeolocation.ts": "Hook that requests the browser's geolocation, stores coordinates in sessionStorage, and exposes loading/error state along with a requestPermission callback.",
  "frontend/src/hooks/useImageUpload.ts": "Hook that handles image file selection via drag-and-drop or file input, validates format and size, converts to base64, and exposes preview and error state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication using DFINITY's AuthClient, providing a React context and provider that manage login status, identity persistence, and delegation validity.",
  "frontend/src/hooks/useParallax.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, pro profiles, services, gallery, bookings, and availability using TanStack Query's useQuery and useMutation.",
  "frontend/src/hooks/useScrollReveal.ts": "Empty file, likely a placeholder for a scroll reveal animation hook.",
  "frontend/src/index.css": "Global CSS file defining CSS custom properties (design tokens), base resets, layout for the app container, scrollbar styles, and all keyframe animations used throughout the app.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/cropping.ts": "TypeScript interfaces defining CropParams (scale, offsets, image data) and ImageData (base64 with optional crop params) for image cropping functionality.",
  "frontend/src/utils/auraGenerator.ts": "Empty file, likely a placeholder for an aura/gradient generation utility.",
  "frontend/src/utils/cityData.ts": "Provides Swiss Romande city data including a city list, proximity zones, inter-city distance matrix, and utility functions for distance lookup, proximity categorization, and radius filtering.",
  "frontend/src/utils/confetti.ts": "Implements a canvas-based golden confetti animation that spawns falling particles over 3 seconds and removes itself when complete.",
  "frontend/src/utils/demoData.ts": "Defines TypeScript interfaces and static demo data for services (barber, hair, aesthetics) and pro profiles used for UI prototyping or fallback display.",
  "frontend/src/utils/haversine.ts": "Exports a calculateDistance function that computes the distance in kilometers between two GPS coordinates using the Haversine formula.",
  "frontend/src/utils/imageCompression.ts": "Provides utilities to measure localStorage usage, compress a base64 image via canvas to JPEG, and calculate the byte size of a base64 string.",
  "frontend/src/utils/nominatim.ts": "Geocodes city name strings to coordinates via the Nominatim API with localStorage caching, and provides a haversineDistance helper for coordinate-based distance calculation.",
  "frontend/src/utils/servicePresets.ts": "Defines service preset data (name, price, duration, badges) grouped by category (Barber, Coiffure, Esthétique, Massage) and exports the category list and types.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the NEXUS design system: custom dark color palette, typography, border radii, box shadows, and a full set of named animations/keyframes.",
  "project_state.json": "Tracks the overall NEXUS project state including architecture decisions (ICP/Motoko, Internet Identity, 5 canisters), known issues, and a list of existing frontend features with their requirement IDs and versions."
}