{
  "kind": "build_request",
  "title": "Add ProApp.tsx — Standalone Pro Space with useState Navigation",
  "projectName": "NEXUS Pro",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Create a new file `frontend/src/components/ProApp.tsx` as a fully self-contained React component (no React Router, no external navigation libs). It must include all pro-space screens and sub-components inline or imported locally: Dashboard, Radar, Wallet, Business, Subscription Modal, and Subscription Success animation. Navigation between these screens must be driven exclusively by `useState`. The component must export `ProApp` as a default export.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Greffe ProApp.tsx sur le projet existant. Ne pas reconstruire ce qui fonctionne déjà.",
          "LIVRE ProApp.tsx COMPLET."
        ]
      },
      "acceptanceCriteria": [
        "ProApp.tsx exists as a new file and exports a default React component named ProApp",
        "All navigation within ProApp uses useState with no React Router or external routing library",
        "The component renders Dashboard, Radar, Wallet, and Business tabs",
        "A Subscription Modal screen and a Subscription Success animation screen are included",
        "No existing files outside ProApp.tsx are broken or modified by this addition"
      ]
    },
    {
      "id": "REQ-2",
      "text": "In `frontend/src/components/ProApp.tsx`, define a color constants object `C` that includes the value `t4: '#2E2E3E'`. Use `C.t4` for the `IconCamera` fill color and for all other very subtle/discrete UI elements (placeholder text, dividers, inactive icon strokes, secondary backgrounds, etc.).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "C.t4 = '#2E2E3E'",
          "Ajouter dans l objet C : t4: '#2E2E3E'",
          "Utiliser C.t4 pour IconCamera et tous les éléments très discrets."
        ]
      },
      "acceptanceCriteria": [
        "The C object inside ProApp.tsx contains the key t4 with value '#2E2E3E'",
        "IconCamera SVG uses C.t4 as its fill/stroke color",
        "All visually discrete elements (inactive icons, dividers, placeholder text) reference C.t4"
      ]
    },
    {
      "id": "REQ-3",
      "text": "In `frontend/src/components/RoleSelection.tsx` (or `RoleSelectionV2.tsx`, whichever is currently active in ScreenRouter), replace the navigation target for the 'Professionnel' role selection with a render of `<ProApp />`. The old broken pro space component must no longer be rendered when the user selects 'Professionnel'. Import ProApp from `./ProApp` and render it in place of the previous pro route/component.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "La sélection du rôle existe déjà. Quand user tape 'Professionnel' sur l écran choix du rôle → afficher <ProApp /> directement.",
          "Remplacer l ancien espace pro cassé par ce nouveau composant."
        ]
      },
      "acceptanceCriteria": [
        "Selecting 'Professionnel' on the role selection screen renders <ProApp /> instead of any previously broken pro component",
        "The client navigation flow is completely unaffected",
        "No black screen or crash occurs after selecting the professional role"
      ]
    }
  ],
  "constraints": [
    "Do not modify or rebuild the existing client navigation flow in App.tsx or ScreenRouter.tsx",
    "Do not use React Router, any external routing library, or URL-based navigation inside ProApp.tsx",
    "Do not touch immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui",
    "ProApp.tsx must be a single self-contained component file — no new context providers, no new global state outside the component"
  ],
  "nonGoals": [
    "Rebuilding or modifying any part of the existing client-side app",
    "Adding backend endpoints or Motoko logic",
    "Implementing real Stripe/payment processing inside ProApp",
    "Creating new shared context providers",
    "Modifying App.tsx root structure"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}