{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "NEXUS v8.0 — Frontend Production Platform (Payrexx TWINT, Internet Identity)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create frontend Payrexx integration module with TWINT payment gateway functions",
      "acceptanceCriteria": [
        "`createSubscriptionUrl` posts to `https://nexus.payrexx.com/api/v1/Gateway/` with amount=1990, currency=CHF, psp[0]=twint, purpose='Abonnement NEXUS Pro 7j'",
        "`createBookingUrl` posts with Math.round(montant*100) as amount, currency=CHF, psp[0]=twint",
        "Both functions return `data.data?.[0]?.link ?? ''`",
        "Authorization header uses Basic btoa(`${INSTANCE}:${SECRET}`)",
        "No Stripe or Revolut imports or references in any file"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/payrexx.ts",
          "operation": "create",
          "description": "Create Payrexx module with `createSubscriptionUrl(proId, email, phone)` and `createBookingUrl(bookingId, montant, serviceName, email)` functions. Both call Payrexx Gateway API directly using VITE_PAYREXX_INSTANCE and VITE_PAYREXX_SECRET from env vars. Always pass psp[0]=twint. Authorization uses Basic auth with btoa. Return gateway link URL from response data array."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Create frontend Twilio SMS proxy module for OTP verification",
      "acceptanceCriteria": [
        "`sendOTP` posts `{ phone }` to `${VITE_WORKER_URL}/send-otp`",
        "`verifyOTP` posts `{ phone, code }` to `${VITE_WORKER_URL}/verify-otp` and returns boolean",
        "No Twilio credentials appear anywhere in frontend source"
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/twilio.ts",
          "operation": "create",
          "description": "Create Twilio proxy module with `sendOTP(phone)` and `verifyOTP(phone, code)` functions. Both proxy through VITE_WORKER_URL to Cloudflare Worker endpoints (/send-otp and /verify-otp). verifyOTP returns boolean from data.valid. No Twilio credentials exposed in frontend."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Refactor frontend into multi-file architecture with state management, actor, API, notifications, and icons",
      "acceptanceCriteria": [
        "All files in the specified directory structure exist and are non-empty",
        "`useAppState.ts` exports `go()`, `showToast()`, `update()` and a global state object",
        "`actor.ts` uses Internet Identity (DFINITY AuthClient) for real ICP mainnet authentication",
        "`icons/index.tsx` contains 30+ named SVG components, none use emoji characters",
        "`globals.css` defines CSS custom property palette, hides scrollbars, includes keyframe animations"
      ],
      "file_operations": [
        {
          "path": "frontend/src/state/useAppState.ts",
          "operation": "create",
          "description": "Create global state management hook exporting useState-based navigation state with `go(screen)` function, `showToast(message, type)` for toast notifications, and `update()` for forcing re-renders. State includes currentScreen, user profile, notifications, and subscription status."
        },
        {
          "path": "frontend/src/lib/actor.ts",
          "operation": "create",
          "description": "Create ICP actor utility module using Internet Identity (DFINITY AuthClient) for mainnet authentication. Export `createActor()`, `login()`, `logout()` functions. Uses VITE_ICP_CANISTER_ID and VITE_ICP_HOST from env. Replaces current hooks/useInternetIdentity.ts and hooks/useActor.ts logic but does NOT modify those immutable files."
        },
        {
          "path": "frontend/src/lib/api.ts",
          "operation": "create",
          "description": "Create API module wrapping all canister function calls from backend interface. Export typed functions for user profiles, pro profiles, bookings, services, gallery, availability, notifications, admin operations. All functions use the actor instance from lib/actor.ts."
        },
        {
          "path": "frontend/src/lib/notifications.ts",
          "operation": "create",
          "description": "Create notifications utility module with `getNotifications()` and `markRead(notificationId)` functions. Fetches in-app notifications from canister and provides local state management. Returns typed Notification arrays."
        },
        {
          "path": "frontend/src/styles/globals.css",
          "operation": "create",
          "description": "Create global stylesheet defining CSS custom properties for NEXUS color palette (gold: #D4AF37, flash: #FFB800, alert: #FF6B6B, blue: #4A90E2, dark backgrounds). Include keyframe animations for fade-in, slide-up, pulse. Add scrollbar hiding rules. Set mobile viewport resets. Font-family uses Inter from Google Fonts."
        },
        {
          "path": "frontend/src/components/icons/index.tsx",
          "operation": "create",
          "description": "Create icon library module exporting 30+ SVG icon components: Flash, Search, Check, X, Bell, Radar, Wallet, Dashboard, Business, Star, Lock, Eye, EyeOff, Calendar, Clock, MapPin, Phone, Mail, User, Settings, ChevronLeft, ChevronRight, ChevronDown, ChevronUp, Plus, Minus, Edit, Trash, Camera, Image, Upload, Download, Filter, Menu, Home. Each component accepts size and color props. Zero emoji characters."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor App.tsx to use useState routing from useAppState instead of current routing logic. Add ToastContainer from react-toastify. Integrate NotifsPanel slide-in component. Remove any React Router dependencies. Maintain QueryClientProvider and InternetIdentityProvider wrappers. Keep fixed full-screen layout with 430px max-width constraint."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Deliver all UI component files with TypeScript props and handlers",
      "acceptanceCriteria": [
        "All 13 component files exist under `src/components/ui/`",
        "Every button component has an `onClick` prop wired",
        "Every input component has an `onChange` prop wired",
        "No emoji characters in any component file",
        "Gold background elements use `color: #050507` for text"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ui/BtnPrimary.tsx",
          "operation": "create",
          "description": "Create primary button component with gold background (#D4AF37), #050507 text color, rounded corners, onClick handler, disabled state, loading state with spinner. TypeScript interface for props (label, onClick, disabled, loading, className)."
        },
        {
          "path": "frontend/src/components/ui/BtnSecondary.tsx",
          "operation": "create",
          "description": "Create secondary button component with dark border, transparent background, white text, rounded corners, onClick handler, disabled state. TypeScript interface for props (label, onClick, disabled, className)."
        },
        {
          "path": "frontend/src/components/ui/Input.tsx",
          "operation": "create",
          "description": "Create input component with dark background, white text, border styling, onChange handler, placeholder, type (text/password/email/tel), value, name props. Support for error state with red border. TypeScript interface for all props."
        },
        {
          "path": "frontend/src/components/ui/Label.tsx",
          "operation": "create",
          "description": "Create label component for form fields with white text, optional required indicator (*), htmlFor prop. TypeScript interface for props (text, htmlFor, required)."
        },
        {
          "path": "frontend/src/components/ui/Card.tsx",
          "operation": "create",
          "description": "Create card container component with dark background, subtle border, rounded corners, padding, shadow. Accepts children and optional onClick for clickable cards. TypeScript interface for props (children, onClick, className)."
        },
        {
          "path": "frontend/src/components/ui/Toast.tsx",
          "operation": "create",
          "description": "Create toast notification component with success/error/info variants, auto-dismiss timer, close button. Uses Sonner or react-toastify under the hood. TypeScript interface for props (message, type, duration, onClose)."
        },
        {
          "path": "frontend/src/components/ui/Header.tsx",
          "operation": "create",
          "description": "Create fixed top header component with NEXUS logo, notification bell icon with unread badge, user avatar or initial. Includes back button when not on root screen. TypeScript interface for props (showBack, onBackClick, notificationCount, userName)."
        },
        {
          "path": "frontend/src/components/ui/TabBarClient.tsx",
          "operation": "create",
          "description": "Create client bottom tab bar with 4 tabs: Explorer, Réservations, Alertes, Profil. Uses flex-shrink-0, never position:fixed. Active tab highlighted in gold. TypeScript interface for props (activeTab, onTabChange). Uses icons from icons/index.tsx."
        },
        {
          "path": "frontend/src/components/ui/TabBarPro.tsx",
          "operation": "create",
          "description": "Create pro bottom tab bar with 4 tabs: Radar, Wallet, Dashboard, Business. Uses flex-shrink-0, never position:fixed. Active tab highlighted in gold. TypeScript interface for props (activeTab, onTabChange). Uses icons from icons/index.tsx."
        },
        {
          "path": "frontend/src/components/ui/TabBarAdmin.tsx",
          "operation": "create",
          "description": "Create admin bottom tab bar with 3 tabs: Pros, Bookings, Revenus. Uses flex-shrink-0, never position:fixed. Active tab highlighted in gold. TypeScript interface for props (activeTab, onTabChange). Uses icons from icons/index.tsx."
        },
        {
          "path": "frontend/src/components/ui/BottomSheet.tsx",
          "operation": "create",
          "description": "Create bottom sheet modal component with slide-up animation, overlay backdrop, drag handle, and close-on-backdrop-click. TypeScript interface for props (isOpen, onClose, title, children)."
        },
        {
          "path": "frontend/src/components/ui/ProgressCircle.tsx",
          "operation": "create",
          "description": "Create SVG circular progress indicator with configurable size, stroke width, colors, and percentage value displayed in center. TypeScript interface for props (percentage, size, strokeWidth, color, backgroundColor)."
        },
        {
          "path": "frontend/src/components/ui/Shimmer.tsx",
          "operation": "create",
          "description": "Create skeleton loader component with shimmer animation effect for loading states. Supports variants (rect, circle, text). TypeScript interface for props (variant, width, height, count)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Deliver all authentication screens with Internet Identity and SMS OTP",
      "acceptanceCriteria": [
        "LoginScreen uses real Internet Identity via `actor.ts`, no hardcoded credentials",
        "OTPScreen renders 6 individual digit inputs (not 4)",
        "OTPScreen calls `verifyOTP` from `lib/twilio.ts`, not a hardcoded demo code",
        "All screens have a back button with onClick handler"
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/auth/LoginScreen.tsx",
          "operation": "create",
          "description": "Create login screen using Internet Identity authentication from lib/actor.ts. On successful login, check if user profile exists via lib/api.ts. If profile exists, navigate to roleSelection screen; otherwise navigate to roleSelection to choose client/pro. Include NEXUS branding and animated background orbs. Back button returns to splash screen."
        },
        {
          "path": "frontend/src/screens/auth/RoleScreen.tsx",
          "operation": "create",
          "description": "Create role selection screen with two large cards: Client and Professional. Each card shows icon, title, and description. Client card navigates to OTPScreen. Professional card navigates to ProOnboardingModal then builder flow. Back button returns to LoginScreen. Uses icons from icons/index.tsx."
        },
        {
          "path": "frontend/src/screens/auth/OTPScreen.tsx",
          "operation": "create",
          "description": "Create 6-digit SMS OTP verification screen with individual digit inputs. Calls sendOTP from lib/twilio.ts on mount to send code to user's phone. User enters 6 digits, then clicks verify which calls verifyOTP from lib/twilio.ts. On success, saves role to backend via lib/api.ts and navigates to appropriate screen (explorer for client, nexusOS for pro). Back button returns to RoleScreen. No hardcoded demo code."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Deliver all client screens with booking flow and Payrexx TWINT payment",
      "acceptanceCriteria": [
        "All 11 client screen files exist and are non-empty",
        "Booking5Screen (confirmation) calls `createBookingUrl` and uses `window.location.href` for redirect",
        "No `setTimeout` used to simulate payment",
        "No Stripe references",
        "No `100vh` CSS values",
        "Layout uses `flex flex-col` with fixed inset-0, scroll zone uses `flex-1 overflow-y-auto`, CTA button uses `flex-shrink-0`"
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/client/ExplorerScreen.tsx",
          "operation": "create",
          "description": "Create explorer screen fetching active and flash pros from backend via lib/api.ts. Display search bar, category filter pills (Barber, Coiffure, Esthétique, Massage), and scrollable pro cards with cover image, name, rating, location, and badges. Flash pros section at top. Layout: flex flex-col fixed inset-0, scroll zone flex-1 overflow-y-auto, TabBarClient at bottom with flex-shrink-0. Uses Header component and category icons from icons/index.tsx."
        },
        {
          "path": "frontend/src/screens/client/FicheProScreen.tsx",
          "operation": "create",
          "description": "Create professional detail page showing cover image, profile info (name, category, city, rating), and 3 tabs: Services, Gallery, Reviews. Services tab lists bookable services with prices and durations. Each service has 'Réserver' button navigating to Booking1Screen. Gallery shows uploaded photos. Reviews show client feedback and ratings. Layout: flex flex-col fixed inset-0, scrollable content flex-1 overflow-y-auto. Back button returns to ExplorerScreen."
        },
        {
          "path": "frontend/src/screens/client/Booking1Screen.tsx",
          "operation": "create",
          "description": "Create booking step 1: service selection. Display selected pro's services with radio buttons. Shows service name, price, duration, badges. 'Continuer' CTA button (gold background, #050507 text, flex-shrink-0) navigates to Booking2Screen with selected serviceId. Layout: flex flex-col fixed inset-0, scroll zone flex-1 overflow-y-auto. Back button returns to FicheProScreen."
        },
        {
          "path": "frontend/src/screens/client/Booking2Screen.tsx",
          "operation": "create",
          "description": "Create booking step 2: location selection. Two options: 'À domicile' (at home) or 'En studio'. Display address input if at-home selected. 'Continuer' CTA (flex-shrink-0) navigates to Booking3Screen with location data. Layout: flex flex-col fixed inset-0, form content flex-1 overflow-y-auto. Back button returns to Booking1Screen."
        },
        {
          "path": "frontend/src/screens/client/Booking3Screen.tsx",
          "operation": "create",
          "description": "Create booking step 3: date and time selection. Display calendar for date picker (today through 7 days out) and available time slots from pro's weekly availability. 'Continuer' CTA (flex-shrink-0) navigates to Booking4Screen with date and timeSlot. Layout: flex flex-col fixed inset-0, content flex-1 overflow-y-auto. Back button returns to Booking2Screen."
        },
        {
          "path": "frontend/src/screens/client/Booking4Screen.tsx",
          "operation": "create",
          "description": "Create booking step 4: contact information. Display inputs for name, phone, email. All fields required. 'Continuer' CTA (flex-shrink-0) navigates to Booking5Screen with contact data. Layout: flex flex-col fixed inset-0, form flex-1 overflow-y-auto. Back button returns to Booking3Screen."
        },
        {
          "path": "frontend/src/screens/client/Booking5Screen.tsx",
          "operation": "create",
          "description": "Create booking step 5: confirmation summary. Display all booking details (pro, service, date, time, location, price). 'Confirmer et payer' CTA (flex-shrink-0) creates booking via lib/api.ts, then calls createBookingUrl from lib/payrexx.ts with booking amount and service name. On receiving Payrexx gateway URL, redirect via window.location.href (NOT router navigation). No setTimeout fake flows. No Stripe references. Layout: flex flex-col fixed inset-0, summary flex-1 overflow-y-auto. Back button returns to Booking4Screen."
        },
        {
          "path": "frontend/src/screens/client/LiveStatusScreen.tsx",
          "operation": "create",
          "description": "Create live booking status screen showing 5-step timeline: En attente → Confirmée → En cours → Terminée → (Annulée). Display elapsed time counter, pro info, service details. Real-time status updates from backend via lib/api.ts. Layout: flex flex-col fixed inset-0, timeline flex-1 overflow-y-auto. Back button returns to ReservationsScreen."
        },
        {
          "path": "frontend/src/screens/client/ReservationsScreen.tsx",
          "operation": "create",
          "description": "Create reservations list screen fetching client bookings via lib/api.ts. Display tabs for Pending, Confirmed, History. Each booking card shows pro name, service, date, time, status badge. Click card navigates to LiveStatusScreen. Empty state shows 'Aucune réservation' with CTA to ExplorerScreen. Layout: flex flex-col fixed inset-0, list flex-1 overflow-y-auto, TabBarClient flex-shrink-0."
        },
        {
          "path": "frontend/src/screens/client/AlertesScreen.tsx",
          "operation": "create",
          "description": "Create alerts/notifications screen fetching notifications via lib/notifications.ts. Display list of in-app notifications with unread indicators. Mark as read on tap. Empty state shows 'Aucune alerte'. Layout: flex flex-col fixed inset-0, list flex-1 overflow-y-auto, TabBarClient flex-shrink-0."
        },
        {
          "path": "frontend/src/screens/client/ClientProfilScreen.tsx",
          "operation": "create",
          "description": "Create client profile screen displaying user info, past bookings count, favorite pros. Includes logout button calling lib/actor.ts logout. Settings section for notifications preferences. Layout: flex flex-col fixed inset-0, content flex-1 overflow-y-auto, TabBarClient flex-shrink-0."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Deliver all pro screens with subscription modal and Payrexx TWINT payment",
      "acceptanceCriteria": [
        "All 6 pro screen files exist",
        "SubscriptionModal calls `createSubscriptionUrl` and redirects via `window.location.href`",
        "SubscriptionModal amount is 1990 CHF cents (19.90 CHF), TWINT only",
        "ProBusinessScreen has 5 tabs: profile, services, tarifs, payment/IBAN, gallery",
        "No emoji in any pro screen file"
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/pro/ProDashboardScreen.tsx",
          "operation": "create",
          "description": "Create pro dashboard screen displaying booking stats, revenue this month, acceptance rate, and profile status. Fetches data from backend via lib/api.ts. Shows activation banner if profile not published. Charts for bookings and revenue trends. Layout: flex flex-col fixed inset-0, content flex-1 overflow-y-auto, TabBarPro flex-shrink-0."
        },
        {
          "path": "frontend/src/screens/pro/ProRadarScreen.tsx",
          "operation": "create",
          "description": "Create pro radar screen for managing booking requests. Three tabs: Pending, Confirmed, History with counts. Pending shows incoming requests with Accept/Decline actions. Actions call updateBookingStatus from lib/api.ts. Real-time updates. Layout: flex flex-col fixed inset-0, tabs and list flex-1 overflow-y-auto, TabBarPro flex-shrink-0."
        },
        {
          "path": "frontend/src/screens/pro/ProWalletScreen.tsx",
          "operation": "create",
          "description": "Create pro wallet screen displaying CHF balance fetched via lib/api.ts. Shows recent transactions list. Transfer button with 30-second cooldown. On transfer, shows toast notification. Layout: flex flex-col fixed inset-0, balance and transactions flex-1 overflow-y-auto, TabBarPro flex-shrink-0."
        },
        {
          "path": "frontend/src/screens/pro/ProBusinessScreen.tsx",
          "operation": "create",
          "description": "Create pro business management screen with 5 tabs: Profile (bio, slogan, languages, at-home service toggle), Services (list with add/edit/delete), Tarifs (pricing per service), Payment/IBAN (bank details for transfers), Gallery (main photo + up to 5 gallery photos using ImageUploader). Each tab has save button. Profile completion percentage shown at top. Preview button opens ExplorerPreview modal. Layout: flex flex-col fixed inset-0, tab content flex-1 overflow-y-auto, TabBarPro flex-shrink-0. All forms call lib/api.ts functions."
        },
        {
          "path": "frontend/src/screens/pro/SubscriptionModal.tsx",
          "operation": "create",
          "description": "Create subscription modal (BottomSheet component) presenting NEXUS Pro plan: 19.90 CHF/month with 7-day free trial. Lists benefits (profile visibility, booking management, payment processing, analytics, notifications). 'Démarrer l'essai gratuit' button collects pro's email and phone, then calls createSubscriptionUrl from lib/payrexx.ts with amount=1990 (CHF cents), psp[0]=twint. On receiving Payrexx URL, redirect via window.location.href. Loading state during API call. Close button dismisses modal. No Stripe references."
        },
        {
          "path": "frontend/src/screens/pro/SuccessScreen.tsx",
          "operation": "create",
          "description": "Create subscription success screen shown after successful Payrexx payment redirect. Display checkmark icon, success message, and subscription details. 'Accéder à NEXUS Pro' CTA navigates to ProDashboardScreen. Layout: flex flex-col fixed inset-0, content flex-1 overflow-y-auto centered."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Deliver all admin screens with localStorage credential validation",
      "acceptanceCriteria": [
        "All 5 admin screen files exist",
        "AdminLoginScreen validates against credentials stored in localStorage by SetupScreen",
        "AdminDashboardScreen shows real canister data via `lib/api.ts`",
        "No emoji in any admin screen"
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/admin/AdminLoginScreen.tsx",
          "operation": "create",
          "description": "Create admin login screen with email and password inputs. Validates credentials against values stored in localStorage (set by SetupScreen during first-run). On successful validation, navigates to AdminDashboardScreen. If localStorage has no admin credentials, redirects to SetupScreen first. Layout: flex flex-col fixed inset-0, centered form."
        },
        {
          "path": "frontend/src/screens/admin/AdminDashboardScreen.tsx",
          "operation": "create",
          "description": "Create admin dashboard displaying system metrics via lib/api.ts: total registered users, total active pros, total bookings, revenue stats. Charts for trends. Links to AdminProsScreen, AdminBookingsScreen, AdminRevenusScreen. Layout: flex flex-col fixed inset-0, content flex-1 overflow-y-auto, TabBarAdmin flex-shrink-0."
        },
        {
          "path": "frontend/src/screens/admin/AdminProsScreen.tsx",
          "operation": "create",
          "description": "Create admin pros management screen listing all professionals via lib/api.ts. Display pro cards with name, category, status, verification badge. 'Valider' button calls adminValidatePro from lib/api.ts. Search and filter by status (pending, verified). Layout: flex flex-col fixed inset-0, list flex-1 overflow-y-auto, TabBarAdmin flex-shrink-0."
        },
        {
          "path": "frontend/src/screens/admin/AdminBookingsScreen.tsx",
          "operation": "create",
          "description": "Create admin bookings screen listing all bookings via lib/api.ts. Display booking cards with client name, pro name, service, date, status. Filter by status. Export CSV functionality. Layout: flex flex-col fixed inset-0, list flex-1 overflow-y-auto, TabBarAdmin flex-shrink-0."
        },
        {
          "path": "frontend/src/screens/admin/AdminRevenusScreen.tsx",
          "operation": "create",
          "description": "Create admin revenue screen displaying financial metrics via lib/api.ts: total revenue, revenue by category, revenue by pro, monthly trends. Charts and tables. Layout: flex flex-col fixed inset-0, content flex-1 overflow-y-auto, TabBarAdmin flex-shrink-0."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Implement first-run SetupScreen for admin configuration",
      "acceptanceCriteria": [
        "SetupScreen renders when env vars are empty or admin credentials absent from localStorage",
        "All inputs have onChange handlers",
        "Password and confirm password fields validate they match before saving",
        "'Initialize NEXUS' button is gold background with #050507 text",
        "On submit, values are persisted to localStorage AND written to canister via `lib/api.ts`",
        "After successful setup, navigates to AdminLoginScreen"
      ],
      "file_operations": [
        {
          "path": "frontend/src/screens/SetupScreen.tsx",
          "operation": "create",
          "description": "Create first-run configuration screen displayed before AdminLoginScreen when VITE_PAYREXX_INSTANCE, VITE_PAYREXX_SECRET, or VITE_WORKER_URL are empty OR localStorage has no admin credentials. Title 'NEXUS Initial Configuration' (Inter 800 28px). Three sections: Payrexx (Instance input placeholder 'nexus', Secret API input type=password), Twilio (Worker URL input placeholder 'https://...'), Admin (email, password, confirm password). Password fields validate match. 'Initialize NEXUS' CTA button (gold background, #050507 text, flex-shrink-0) saves all values to localStorage AND calls backend admin config setter via lib/api.ts. On success, navigates to AdminLoginScreen. Layout: flex flex-col fixed inset-0, form flex-1 overflow-y-auto."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Create production environment configuration file",
      "acceptanceCriteria": [
        "`.env.production` file exists at project root",
        "All 5 env vars are present",
        "No real secrets are committed — placeholder values used"
      ],
      "file_operations": [
        {
          "path": ".env.production",
          "operation": "create",
          "description": "Create .env.production file at project root with template environment variables: VITE_PAYREXX_INSTANCE=nexus, VITE_PAYREXX_SECRET=your_secret_here, VITE_WORKER_URL=https://nexus-sms.workers.dev, VITE_ICP_CANISTER_ID=your_canister_id_here, VITE_ICP_HOST=https://ic0.app. All placeholder values clearly marked for replacement. Include comment header explaining setup instructions."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Enforce layout rules and remove all emojis across frontend",
      "acceptanceCriteria": [
        "No `100vh` string found in any `.tsx` or `.css` file",
        "No `position: fixed` on any tab bar component",
        "No emoji characters (unicode or literal) in any source file",
        "All gold/amber background elements have `color: #050507`",
        "Google Fonts Inter is loaded (already in index.html) and applied via CSS variable"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global CSS to enforce layout rules: ensure no 100vh values, add layout utilities for flex flex-col fixed inset-0 pattern, flex-1 overflow-y-auto for scroll zones, flex-shrink-0 for tab bars and CTAs. Verify scrollbar hiding rules. Confirm gold background pairs with #050507 text color. Remove any emoji characters. Ensure Inter font variable is applied globally via :root."
        },
        {
          "path": "frontend/src/components/Explorer.tsx",
          "operation": "modify",
          "description": "Refactor Explorer layout to use flex flex-col fixed inset-0 on root container, flex-1 overflow-y-auto on scrollable pro list, flex-shrink-0 on TabBarClient. Remove any 100vh, position:fixed on tabs. Remove any emoji characters. Ensure gold accents use #050507 text."
        },
        {
          "path": "frontend/src/components/ProLayout.tsx",
          "operation": "modify",
          "description": "Refactor ProLayout to use flex flex-col fixed inset-0 on root container, flex-1 on content area, flex-shrink-0 on TabBarPro. Remove any 100vh, position:fixed on tabs. Remove any emoji characters. Ensure subscription modal overlays are properly positioned."
        },
        {
          "path": "frontend/src/components/BookingFlow.tsx",
          "operation": "modify",
          "description": "Refactor all booking step screens to use flex flex-col fixed inset-0 layout, flex-1 overflow-y-auto on content, flex-shrink-0 on CTA buttons. Remove any 100vh. Remove any emoji characters. Ensure gold CTAs use #050507 text. Reference workspace path frontend/public/assets/generated/<filename>.dim_WIDTHxHEIGHT.png for any generated images used in booking confirmation."
        },
        {
          "path": "frontend/src/components/AdminPanel.tsx",
          "operation": "modify",
          "description": "Refactor AdminPanel layout to use flex flex-col fixed inset-0, flex-1 overflow-y-auto on content, flex-shrink-0 on TabBarAdmin. Remove any 100vh, position:fixed on tabs. Remove any emoji characters."
        },
        {
          "path": "frontend/src/components/icons/Icons.tsx",
          "operation": "modify",
          "description": "Review and remove any emoji characters from Icons.tsx. All icons must be pure SVG path-based components. Ensure 30+ icon components exist with consistent naming and props (size, color)."
        },
        {
          "path": "frontend/src/components/ui/TabBarClient.tsx",
          "operation": "modify",
          "description": "Ensure TabBarClient uses flex-shrink-0 and never position:fixed. Remove any emoji characters. Active tab highlighted in gold with #050507 text."
        },
        {
          "path": "frontend/src/components/ui/TabBarPro.tsx",
          "operation": "modify",
          "description": "Ensure TabBarPro uses flex-shrink-0 and never position:fixed. Remove any emoji characters. Active tab highlighted in gold with #050507 text."
        },
        {
          "path": "frontend/src/components/ui/TabBarAdmin.tsx",
          "operation": "modify",
          "description": "Ensure TabBarAdmin uses flex-shrink-0 and never position:fixed. Remove any emoji characters. Active tab highlighted in gold with #050507 text."
        }
      ]
    }
  ]
}