{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add ProApp.tsx — Standalone Pro Space with useState Navigation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create a fully self-contained ProApp.tsx component with useState-based navigation covering Dashboard, Radar, Wallet, Business, Subscription Modal, and Success screens",
      "acceptanceCriteria": [
        "ProApp.tsx exists as a new file and exports a default React component named ProApp",
        "All navigation within ProApp uses useState with no React Router or external routing library",
        "The component renders Dashboard, Radar, Wallet, and Business tabs",
        "A Subscription Modal screen and a Subscription Success animation screen are included",
        "No existing files outside ProApp.tsx are broken or modified by this addition"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProApp.tsx",
          "operation": "create",
          "description": "Create a new self-contained React component that implements the entire pro space experience with useState-driven screen navigation. Include inline or locally-imported sub-components for Dashboard (greeting, stats, activation banner), Radar (incoming/confirmed bookings with timers and actions), Wallet (balance, escrow, transactions), Business (identity/payment/services/gallery tabs with photo upload), Subscription Modal (email entry with trial activation), and Subscription Success (progress bar with confetti animation). Define a color constants object C containing t4: '#2E2E3E' for discrete UI elements. Use a tab bar at the bottom to switch between main screens. Export ProApp as default. Reference backend methods from the useActor hook and leverage existing utility functions (e.g., demoData, haversine, imageCompression). Ensure all visual elements follow the NEXUS design system (gold accents, void backgrounds, smooth animations). Do not introduce React Router or URL-based navigation."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Define color constant C.t4 = '#2E2E3E' in ProApp.tsx and apply it to IconCamera and all discrete UI elements",
      "acceptanceCriteria": [
        "The C object inside ProApp.tsx contains the key t4 with value '#2E2E3E'",
        "IconCamera SVG uses C.t4 as its fill/stroke color",
        "All visually discrete elements (inactive icons, dividers, placeholder text) reference C.t4"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProApp.tsx",
          "operation": "modify",
          "description": "Ensure the C color constants object at the top of ProApp.tsx includes t4: '#2E2E3E'. Apply C.t4 to the fill/stroke of any IconCamera SVG elements, and consistently use C.t4 for all very subtle/discrete UI elements such as placeholder text colors, divider borders, inactive icon strokes, secondary background tints, and other low-contrast elements throughout all pro-space screens (Dashboard, Radar, Wallet, Business, Subscription Modal)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Wire ProApp into RoleSelection/RoleSelectionV2 to render <ProApp /> when user selects 'Professionnel' role",
      "acceptanceCriteria": [
        "Selecting 'Professionnel' on the role selection screen renders <ProApp /> instead of any previously broken pro component",
        "The client navigation flow is completely unaffected",
        "No black screen or crash occurs after selecting the professional role"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RoleSelectionV2.tsx",
          "operation": "modify",
          "description": "Import ProApp from './ProApp'. In the handler for the 'Professionnel' role selection (currently navigating to 'proOnboarding' or setting role to 'professional'), replace the existing navigation or role-setting logic with rendering <ProApp /> directly in place of the role selection screen. Ensure the client role selection path remains unchanged. This wiring replaces the old broken pro space component with the new self-contained ProApp, preventing any black screen or navigation errors."
        }
      ]
    }
  ]
}