{
  "backend/main.mo": "Main Motoko actor implementing user profiles, baby crib reservations with time slot management, loyalty points, Stripe payment integration, and access control using mixins for authorization and blob storage.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including splash screen restoration, Version 8 color palette, Builder 4-step form, and micro-interactions with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose, key functionality, and design system integration for the NEXUS application.",
  "frontend/index.css": "Tailwind CSS configuration with CSS custom properties for light/dark themes, defining color variables, spacing, and design tokens for the component library.",
  "frontend/index.html": "HTML entry point loading Google Fonts (Darker Grotesque, Inter, Playfair Display) and mounting the React application at #root.",
  "frontend/src/App.tsx": "Root React component with AppContextProvider, ScreenRouter managing 12 screen types with forward/backward/fade transitions (300ms), and SupportChat integration.",
  "frontend/src/AppV1.jsx": "Empty or legacy file with no content.",
  "frontend/src/components/BookingContact.tsx": "Booking contact form with name/phone/address fields, Swiss phone validation, conditional address requirement for domicile bookings, success toast, and navigation back to Explorer.",
  "frontend/src/components/BookingDate.tsx": "Displays a date and time picker for booking appointments, showing the next 4 days and 30-minute time slots from 9:00 to 19:00, filtering out past times and provider-blocked slots.",
  "frontend/src/components/BookingLocation.tsx": "Allows users to select between home service (domicile) or studio location for their booking, displaying availability and pricing for each option.",
  "frontend/src/components/Builder.tsx": "Multi-step studio profile builder for tattoo/piercing/branding/illustration artists, collecting cover photo, logo, name, category, cities, phone, and gallery images before publishing.",
  "frontend/src/components/BuilderPreviewModal.tsx": "Modal component that displays a preview of the studio profile being built, showing cover photo, logo, name, category, badges, bio, and social media links.",
  "frontend/src/components/BuilderProgress.tsx": "Progress indicator component showing current step, completed steps with checkmarks, and future steps in a horizontal stepper layout.",
  "frontend/src/components/ClientDashboard.tsx": "Client-facing dashboard displaying pending and completed reservations with the ability to cancel pending bookings and logout.",
  "frontend/src/components/ClientLogin.tsx": "Client login component with two-step phone/OTP authentication flow. Generates a random 4-digit OTP, displays it via toast notification, and validates it before navigating to the client dashboard.",
  "frontend/src/components/CroppingModal.tsx": "Modal component for cropping images with adjustable zoom (scale) and pan (offset). Supports pointer/touch dragging, maintains aspect ratio (3:1 or 1:1), and returns crop parameters including scale, offsets, and original dimensions.",
  "frontend/src/components/Explorer.tsx": "Provider discovery interface with filters for category, mode (Domicile/Salon), and city. Includes geolocation-based sorting to show nearest providers and displays filtered provider cards.",
  "frontend/src/components/GalleryPhotoUpload.tsx": "Gallery manager for uploading multiple photos with a minimum count requirement. Supports adding/removing photo slots (with drag handles) and uses ImageUploader for each slot with 1:1 aspect ratio.",
  "frontend/src/components/ImageUploader.tsx": "Image upload component with drag-and-drop support, file validation (type/size), automatic compression when localStorage is full, and integration with CroppingModal. Persists image data and crop parameters to localStorage.",
  "frontend/src/components/LandingPage.tsx": "Empty component file with no content.",
  "frontend/src/components/NexusOS.tsx": "Provider dashboard (NexusOS) with tabs for booking requests, weekly agenda management, and analytics. Displays pending booking requests with accept/refuse actions and a calendar grid for blocking time slots.",
  "frontend/src/components/PaymentForm.tsx": "A React component that renders a payment form with card number, expiry, and CVC fields, including real-time validation, formatting, and error display. It notifies the parent component of validation state changes via a callback prop.",
  "frontend/src/components/ProLogin.tsx": "A login screen for professional users with email/password authentication against demo credentials (pro@nexus.ch / nexus2025). On successful login, it transitions to the NexusOS screen.",
  "frontend/src/components/ProviderDetail.tsx": "Displays detailed information about a selected service provider including a hero image, services list, and allows users to select a service and continue to booking. Features category-specific background gradients and a back button.",
  "frontend/src/components/RadiusSimulator.tsx": "A visual radius selector component with an animated circular representation and range slider, allowing users to select a distance radius from 0 to 50 km with real-time visual feedback.",
  "frontend/src/components/ServicePhotoUpload.tsx": "Manages photo uploads for a service with a required main photo and up to 4 additional photos (5 total). Includes drag handles, delete buttons, and uses ImageUploader component with local storage persistence.",
  "frontend/src/components/Splash.tsx": "The landing/splash screen component featuring a hero background image, NEXUS branding with Playfair Display typography, and two action buttons to explore services or access the professional space.",
  "frontend/src/components/Subscription.tsx": "React component that handles subscription flow with payment form, displays trial subscription details, and processes payment confirmation with a 30-day trial period.",
  "frontend/src/components/SupportChat.tsx": "Floating chat widget component with auto-responses for common support topics (booking, payment, technical, account) and quick action buttons.",
  "frontend/src/context/AppContext.tsx": "Global app context defining TypeScript interfaces for providers, services, bookings, subscriptions, reviews, sessions, and screen navigation state management.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useCarousel.ts": "Empty file, likely placeholder for carousel functionality.",
  "frontend/src/hooks/useCountingAnimation.ts": "Empty file, likely placeholder for counting animation logic.",
  "frontend/src/hooks/useCustomCursor.ts": "Empty file, likely placeholder for custom cursor functionality.",
  "frontend/src/hooks/useImageUpload.ts": "Custom hook for handling image uploads with drag-and-drop support, file validation (format, size), and base64 conversion with preview.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useParallax.ts": "Empty file, likely placeholder for parallax scrolling effects.",
  "frontend/src/hooks/useScrollReveal.ts": "Empty file, likely placeholder for scroll-triggered reveal animations.",
  "frontend/src/index.css": "Global CSS with Tailwind imports, custom CSS variables for dark theme color palette (#0a0a0a black, #E8D5B0 sand accent), button styles (btn-sand, btn-outline-white, btn-white) with hover/active micro-interactions, form input styles with focus states, card hover effects, and shake animation for error states.",
  "frontend/src/main.tsx": "React application entry point that sets up QueryClient and wraps the App component with QueryClientProvider and InternetIdentityProvider for authentication and data fetching.",
  "frontend/src/types/cropping.ts": "TypeScript interfaces for image cropping functionality, defining CropParams (scale, offsets, base64 data, dimensions) and ImageData (base64 string with optional crop parameters).",
  "frontend/src/utils/auraGenerator.ts": "Empty utility file, likely placeholder for future aura generation functionality.",
  "frontend/src/utils/haversine.ts": "Implements Haversine formula to calculate distance in kilometers between two GPS coordinates (latitude/longitude pairs), rounded to one decimal place.",
  "frontend/src/utils/imageCompression.ts": "Utility functions for localStorage usage tracking, base64 image compression using canvas with configurable JPEG quality, and calculating base64 string size in bytes.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both regular query strings and hash-based routing, with sessionStorage persistence functions for maintaining state (like admin tokens) across navigation and URL cleanup helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark theme with custom colors (#0a0a0a background, #E8D5B0 sand accent), Inter/Playfair Display fonts, custom border radii, glow box shadows, and accordion animations with tailwindcss-animate plugin.",
  "project_state.json": "Project state document describing NEXUS Platform as an ultra-premium tattoo studio/branding platform with Caffeine stack (Motoko + React/TypeScript + Tailwind), featuring studio profiles, booking calendar, quote generator, explorer module, and 39 CHF/month pricing with complete design system specifications."
}