{
  "backend/main.mo": "Main Motoko actor implementing baby crib reservation system with user profiles, services, reservations, loyalty points, and role-based access control using AccessControl and MixinAuthorization modules.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including ProLogin authentication, NexusOS RADAR/WALLET/PORTFOLIO tabs, Builder screen, and Subscription screen with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files describing NEXUS app components including routing, context, screens (Splash, Explorer, Booking flow, ProLogin, NexusOS, Builder), and utilities.",
  "frontend/index.css": "Tailwind CSS configuration with NEXUS design system CSS variables for light/dark themes, including color tokens, spacing, and custom properties for UI components.",
  "frontend/index.html": "HTML entry point loading Google Fonts (Playfair Display italic and Inter 900) and mounting React app to #root div.",
  "frontend/src/App.tsx": "Root React component with AppContextProvider and ScreenRouter implementing animated screen transitions (slide-left/right/fade) between 12 app screens with 300ms duration.",
  "frontend/src/AppV1.jsx": "Empty or legacy file with no content (truncated in provided source).",
  "frontend/src/components/BookingContact.tsx": "Booking contact form screen with name/phone/address fields, Swiss phone validation, conditional address requirement for domicile bookings, success toast, and navigation back to Explorer.",
  "frontend/src/components/BookingDate.tsx": "Date and time selection component for booking appointments, displaying a 4-day calendar with 30-minute time slots (9:00-19:00), filtering past times and provider-blocked slots, with category-specific gradient backgrounds.",
  "frontend/src/components/BookingLocation.tsx": "Location selection screen for bookings that allows users to choose between at-home (domicile) or studio service, displaying availability and pricing for each option based on provider configuration.",
  "frontend/src/components/Builder.tsx": "Multi-step provider onboarding wizard with 4 steps: basic info (name, category, city), logistics (service modes and studio address), services (name, pricing, duration), and availability (weekly time slots), culminating in subscription flow.",
  "frontend/src/components/ClientDashboard.tsx": "Client dashboard displaying pending and completed reservations with details (provider, service, date/time, location, price) and ability to cancel pending bookings.",
  "frontend/src/components/ClientLogin.tsx": "Two-step client authentication flow: phone number entry followed by OTP verification, with a simulated 4-digit code generation displayed via toast notification for demo purposes.",
  "frontend/src/components/Explorer.tsx": "Provider discovery screen with category/mode/city filters, geolocation-based sorting, and distance calculation. Displays filtered provider cards and navigates to provider detail on click.",
  "frontend/src/components/NexusOS.tsx": "Professional dashboard with tabs for booking requests, weekly agenda management, and portfolio. Handles booking acceptance/refusal, slot blocking/unblocking, and navigation between pro and client modes.",
  "frontend/src/components/ProLogin.tsx": "Professional login form with hardcoded demo credentials (pro@nexus.ch / nexus2025). Authenticates and redirects to NexusOS on success, shows toast error on failure.",
  "frontend/src/components/ProviderDetail.tsx": "Provider detail view showing cover photo, services list with pricing, and service selection. Navigates to booking location screen when a service is selected and confirmed.",
  "frontend/src/components/Splash.tsx": "Landing screen with hero image, NEXUS branding, and two action buttons: 'EXPLORER' (navigates to explorer) and 'ESPACE PRO' (currently no action).",
  "frontend/src/components/Subscription.tsx": "Subscription onboarding screen displaying pricing (free first month, then CHF 49/month), feature list, and a subscribe button that publishes a demo studio and navigates to NexusOS.",
  "frontend/src/context/AppContext.tsx": "Defines global app state context with TypeScript types for providers, services, bookings, sessions (client/pro), and screen navigation. Exports AppState interface with all state setters and navigation methods for managing the booking flow and authentication.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance using Internet Identity authentication. Handles actor creation with identity, admin token initialization, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP integration. Manages login/logout flow, identity persistence, delegation validation, and authentication status with configurable AuthClient options.",
  "frontend/src/index.css": "Global CSS with NEXUS design system: dark theme (#0a0a0a background), sand accent (#E8D5B0), CSS custom properties, typography classes (Inter 900, Playfair Display italic), button styles (white/sand/dark), and screen transition animations (slide/fade).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication, then renders the main App component.",
  "frontend/src/utils/auraGenerator.ts": "Empty utility file, likely placeholder for future aura/visual effect generation functionality.",
  "frontend/src/utils/haversine.ts": "Implements Haversine formula to calculate GPS distance between two coordinates in kilometers, rounded to one decimal place for geolocation features.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens and ability to clear sensitive params from URL.",
  "frontend/tailwind.config.js": "Empty Tailwind configuration file (project uses custom CSS instead of Tailwind per architectural notes).",
  "project_state.json": "Project metadata tracking NEXUS mobile-first beauty/wellness booking app for Swiss Romandie. Documents Sprint 1 completion (screens 1-6 with hardcoded data, geolocation, filters) and Sprint 2 progress (authentication, NEXUS OS with 4 tabs, Builder, client dashboard) with no backend integration yet."
}